export const AGREEMENT_HEADER = `
ข้อกำหนดและเงื่อนไขสำหรับการเป็นสมาชิกแบบชำระค่าบริการ (SUBSCRIPTION)
`;

export const AGREEMENT_CONTENT = `1. บททั่วไป
1.1 ข้อกำหนดและเงื่อนไขสำหรับการเป็นสมาชิกแบบชำระค่าบริการ (SUBSCRIPTION) (“ข้อกำหนดและเงื่อนไข SUBSCRIPTION”) ฉบับนี้อยู่ภายใต้ข้อกำหนดและเงื่อนไขของ FILLGOODS (“ข้อกำหนดและเงื่อนไขของ FILLGOODS”) ซึ่งมีผลผูกพันผู้ใช้บริการแบบชำระค่าบริการ (SUBSCRIPTION) (“สมาชิก”) ที่จะต้องปฏิบัติตามข้อกำหนดและเงื่อนไข SUBSCRIPTION นี้ รวมถึงข้อเสนอการเป็นสมาชิก (“ข้อเสนอ”) ตามแต่ละรายการ เช่น แพ็กเกจซิลเวอร์ แพ็กเกจโกลด์ หรือ แพ็กเกจแพลทินัม และข้อกำหนดและเงื่อนไขการขนส่ง และที่จะมีการแก้ไขเพิ่มเติมในภายหน้า โดยหากข้อกำหนดและเงื่อนไข SUBSCRIPTION นี้ มิได้ระบุไว้เป็นอย่างอื่น ให้คำหรือข้อความๆ ตามข้อกำหนดและเงื่อนไข SUBSCRIPTION นี้มีความหมายเช่นเดียวกับที่ระบุไว้ในข้อกำหนดและเงื่อนไขของ FILLGOODS
1.2 หากความใดในข้อเสนอที่ขัดหรือแย้งกับข้อกำหนดและเงื่อนไข SUBSCRIPTION นี้ ให้ใช้ข้อความในข้อกำหนดและเงื่อนไข SUBSCRIPTION นี้บังคับ
1.3 เมื่อสมาชิกส่งรายละเอียดการชำระเงินให้แก่บริษัท และบริษัทได้อนุมัติการเป็นสมาชิกเรียบร้อยแล้ว ให้ถือว่า (1) สมาชิกได้ยอมรับข้อเสนอ (2) ตกลงและยอมรับข้อกำหนดและเงื่อนไข SUBSCRIPTION นี้ ซึ่งรวมถึงข้อกำหนดและเงื่อนไขการขนส่ง และข้อกำหนดและเงื่อนไขต่าง ๆ ที่สอดคล้องกับการเป็นสมาชิก และ (3) ข้อมูลที่บริษัทเก็บรวบรวมภายใต้ข้อเสนอจะถูกนำไปประมวลผลตามนโยบายความเป็นส่วนตัว ทั้งนี้ ข้อกำหนดและเงื่อนไข SUBSCRIPTION นี้ก่อให้เกิดความสัมพันธ์ทางสัญญาระหว่างบริษัทและสมาชิ

2. ขอบเขตการเป็นสมาชิก
2.1 ภายใต้ข้อกำหนดและเงื่อนไข SUBSCRIPTION ฉบับนี้ รวมถึงเงื่อนไขตามใบแจ้งหนี้ ข้อเสนอ ข้อกำหนดและเงื่อนไขการขนส่ง ข้อกำหนดและเงื่อนไขต่าง ๆ ที่สอดคล้องกับการเป็นสมาชิก และการชำระค่าบริการเมื่อถึงกำหนดชำระ สมาชิกจะได้รับอนุญาตให้มีสิทธิ์โดยจำกัด ไม่ผูกขาดแต่เพียงผู้เดียว และเพิกถอนได้ ในการใช้บริการระบบจัดการร้านค้าออนไลน์ของบริษัทเพิ่มเติมตามข้อเสนอและอัตราค่าบริการที่สมาชิกเลือกและชำระเท่านั้น
2.2 สมาชิกจะได้รับสิทธิ์ใช้ระบบจัดการร้านค้าออนไลน์เพิ่มเติมได้เฉพาะภายใต้ขอบเขตตามข้อเสนอแต่ละรายการที่บริษัทกำหนดเท่านั้น หากสมาชิกมีความประสงค์ที่จะเข้าถึงสิทธิ์เพิ่มเติมยิ่งกว่าข้อเสนอ ณ ปัจจุบันของตน สมาชิกตกลงที่จะชำระค่าบริการสมาชิกเพิ่มเติมตามอัตราค่าบริการที่บริษัทกำหนด
2.3 บริษัทขอสงวนสิทธิ์ในการจำกัดการให้บริการในส่วนที่ใช้เกินขอบเขตสำหรับกรณีที่สมาชิกใช้สิทธิ์เพิ่มเติมเกินขอบเขตข้อเสนอของตน ทั้งนี้ ข้อเสนอและอัตราค่าบริการใหม่ของขอบเขตที่สมาชิกใช้สิทธิ์เพิ่มเติมเกินข้อเสนอของตนจะถูกนำมาปรับใช้แก่สมาชิก และสมาชิกมีหน้าที่ต้องชำระอัตราค่าบริการใหม่หรือค่าบริการเพิ่มเติมภายใน 30 วัน นับจากวันที่สมาชิกใช้สิทธิ์เพิ่มเติมเกินขอบเขตข้อเสนอของตน
2.4 สมาชิกรับทราบว่าข้อกำหนดของสิทธิ์การใช้งานเพิ่มเติมจะถูกระบุไว้ในข้อเสนอตามแต่ละรายการอันแยกออกจากกัน
2.5 สิทธิและหน้าที่ของสมาชิกเป็นเรื่องเฉพาะตัวของสมาชิก โดยสมาชิกไม่อาจโอนสิทธิ และ/หรือหน้าที่ และไม่อาจให้สิทธิช่วงได้ไม่ว่าทั้งหมดหรือบางส่วนให้แก่บุคคลอื่นใด เพื่อการนี้สมาชิกตกลงรับผิดชอบและมีความรับผิดอันต้องชดใช้ค่าเสียหายทั้งหมดที่เกิดขึ้นให้แก่บริษัท ในกรณีมีการเข้าถึงหรือใช้ระบบของบริษัทโดยบุคคลอื่นอันเกิดจากการอนุญาตของสมาชิก หรือบุคคลอื่นใช้ข้อมูลการลงบันทึกของสมาชิกเข้าระบบบริษัท

3. การชำระเงิน
3.1 สมาชิกอาจชำระค่าบริการสมาชิก โดย (1) ชำระค่าบริการล่วงหน้าที่ให้สิทธิ์สมาชิกเข้าใช้บริการของ FILLGOODS ภายในช่วงเวลาที่กำนดไว้ หรือ (2) ชำระค่าบริการล่วงหน้าเป็นรายเดือนโดยเรียกเก็บอัตโนมัติตามรอบที่บริษัทแจ้งให้สมาชิกทราบก่อนการสมัครสมาชิก
3.2 เว้นแต่จะถูกกำหนดไว้เป็นอย่างอื่นในรายการราคา (1) อัตราค่าบริการสมาชิกจะขึ้นอยู่กับข้อเสนอแต่ละรายการ โดยอัตราดังกล่าวยังไม่รวมภาษีมูลค่าเพิ่ม และ (2) หน้าที่การชำระค่าบริการทั้งหมดของสมาชิกไม่สามารถยกเลิกและคืนเป็นเงินได้ไม่ว่ากรณีใดก็ตาม
3.3 บริษัทอาจออกและจัดส่งรายการราคาและใบแจ้งหนี้ให้แก่สมาชิกได้ทั้งในรูปแบบอิเล็กทรอนิกส์หรือรูปแบบกระดาษก็ได้ โดยสมาชิกมีหน้าที่ต้องตรวจสอบความถูกต้อง หากสมาชิกพบข้อผิดพลาด สมาชิกต้องโต้แย้งเป็นหนังสือให้บริษัททราบภายใน 3 (สาม) วัน นับแต่วันที่สมาชิกได้รับรายการราคาหรือใบแจ้งหนี้ หากสมาชิกไม่ทำการโต้แย้งภายในระยะเวลาดังกล่าว ให้ถือว่าสมาชิกตกลงและยอมรับรายการราคาและใบแจ้งหนี้ที่บริษัทได้จัดส่งไป
3.4 สมาชิกตกลงระบุและจัดให้ข้อมูลการชำระเงินที่ให้แก่บริษัทเป็นปัจจุบันและถูกต้องตลอดระยะเวลาการเป็นสมาชิก และมอบสิทธิการหักชำระเงินโดยอัตโนมัติให้แก่บริษัทสำหรับค่าบริการสมาชิกรวมถึงแต่ไม่จำกัดเพียงค่าบริการสมาชิกเพิ่มเติม (หากมี) หากบริษัทไม่สามารถหักชำระเงินค่าบริการสมาชิกผ่านข้อมูลการชำระเงินดังกล่าวได้ บริษัทจะจัดส่งใบแจ้งหนี้ให้แก่สมาชิก และให้นำข้อกำหนดตามข้อ 6 มาใช้บังคับ หรือบริษัทอาจใช้วิธีการอื่นใดตามที่บริษัทเห็นสมควรเพื่อเรียกเก็บค่าบริการข้างต้น
3.5 สมาชิกรับทราบและตกลงว่าบริษัทอาจเปลี่ยนแปลงอัตราค่าบริการสมาชิก รวมถึงค่าบริการสมาชิกเพิ่มเติม ค่าบริการที่เรียกเก็บซ้ำ หรือระยะเวลาการชำระค่าบริการล่วงหน้า ได้เป็นครั้งคราว โดยบริษัทจะแจ้งให้สมาชิกทราบถึงการเปลี่ยนแปลงล่วงหน้า และให้มีผลผูกพันสมาชิกตามวันที่บริษัทกำหนด ยิ่งไปกว่านั้น หากหลังจากการเปลี่ยนแปลงดังกล่าวมีผลบังคับใช้แล้ว และสมาชิกได้ใช้บริการของบริษัทต่อไปให้ถือว่าสมาชิกยอมรับการเปลี่ยนแปลงนั้นแล้ว
3.6 สมาชิกต้องชำระค่าบริการสมาชิกให้แก่บริษัทภายในกำหนดระยะเวลาที่บริษัทกำหนด กรณีที่สมาชิกผิดนัดไม่ชำระค่าบริการตามกำหนดระยะเวลาดังกล่าว สมาชิกจะถูกลดระดับเป็นผู้ใช้บริการแบบทั่วไปทันที และสมาชิกตกลงชำระดอกเบี้ยผิดนัดให้แก่บริษัทในอัตราร้อยละ 15 (สิบห้า) ต่อปี นับแต่วันที่ผิดนัดไปจนกว่าจะได้ชำระครบถ้วน ทั้งนี้ สมาชิกตกลงให้บริษัทมีสิทธิหักกลบลบหนี้ในหนี้ค่าบริการสมาชิก รวมทั้งค่าบริการสมาชิกเพิ่มเติม (หากมี) ได้โดยไม่มีข้อโต้แย้งใดๆ ทั้งสิ้น
3.7 สมาชิกรับทราบและยอมรับว่าสมาชิกไม่สามารถของคืนค่าบริการซึ่งสมาชิกได้ชำระไปแล้ว จากการเปลี่ยนแพ็กเกจปัจจุบันของตนก่อนสิ้นสุดระยะการเป็นสมาชิก เมื่อมีการเปลี่ยนแพ็กเกจโดยสมาชิกจะถือว่า (1) สมาชิกได้ทำการสมัครแพ็กเกจใหม่ในรอบเดือนถัดไปสำหรับสมาชิกที่สมัครสมาชิกแบบช่วงระยะเวลาเป็นเดือน โดยสมาชิกมีหน้าที่ต้องชำระค่าบริการตามอัตราข้อเสนอที่ตนเปลี่ยน หรือ (2) สมาชิกได้ทำการสมัครแพ็กเกจใหม่โดยทันทีสำหรับสมาชิกที่สมัครสมาชิกแบบช่วงระยะเวลาเป็นปี โดยสมาชิกมีหน้าที่ต้องชำระค่าบริการที่เพิ่มขึ้นตามอัตราส่วน ทั้งนี้ สมาชิกจะเสียสิทธิ์ที่ได้รับสำหรับช่วงระยะเวลาของแพ็กเกจเดิมที่ยังไม่ได้ใช้งาน
3.8 สมาชิกมีหน้าที่ต้องรับผิดชอบค่าภาษีตามภาระหน้าที่และตามอัตราที่กฎหมายกำหนด ค่าใช้จ่ายต่าง ๆ อันเกี่ยวเนื่องกับการใช้บริการของบริษัท เช่น ค่าบริการอินเตอร์เน็ต ค่าลิขสิทธิ์ซอฟต์แวร์ของบุคคลที่สาม ฯลฯ ด้วยตนเองทั้งสิ้น

4. ระยะเวลาการเป็นสมาชิกและการยกเลิกการเป็นสมาชิก
4.1 การเป็นสมาชิกจะเริ่มนับตั้งแต่วันที่สมาชิกได้รับการอนุมัติจากบริษัท และจะสิ้นสุดลงตามข้อกำหนดและเงื่อนไขฉบับนี้
4.2 กรณีเป็นสมาชิกแบบชำระค่าบริการล่วงหน้าที่ให้สิทธิ์สมาชิกเข้าใช้บริการของ FILLGOODS ภายในช่วงเวลาที่กำหนดไว้ไม่ว่าจะเป็นช่วงระยะเวลาเป็นเดือนหรือปี ระยะเวลาการเป็นสมาชิกจะสิ้นสุดลงทันทีเมื่อครบกำหนดช่วงระยะเวลาตามที่ระบุไว้
4.3 กรณีเป็นสมาชิกแบบชำระค่าบริการล่วงหน้าเป็นรายเดือนโดยเรียกเก็บอัตโนมัติ การเป็นสมาชิกจะถูกต่ออายุโดยอัตโนมัติหลังจากระยะเวลาการเป็นสมาชิกนั้นสิ้นสุดลง
4.4 การเป็นสมาชิกอาจสิ้นสุดลงก่อนครบกำหนดระยะเวลาการเป็นสมาชิกในกรณีใดกรณีหนึ่งดังต่อไปนี้
4.4.1 เมื่อสมาชิกฝ่าฝืนหรือปฏิบัติผิดเงื่อนไขข้อใดข้อหนึ่งของข้อกำหนดและเงื่อนไขของ FILLGOODS ข้อกำหนดและเงื่อนไข SUBSCRIPTION ฉบับนี้ ข้อเสนอ หรือข้อกำหนดและเงื่อนไขการขนส่ง รวมถึงข้อกำหนดและเงื่อนไขต่าง ๆ ที่สอดคล้องกับการเป็นสมาชิก โดยบริษัทมีสิทธิยกเลิกการเป็นสมาชิกของสมาชิกได้ทันที
4.4.2 บริษัทอาจยกเลิกการเป็นสมาชิกของสมาชิก ข้อตกลงต่าง ๆ ระหว่างบริษัทกับสมาชิกเมื่อใดก็ได้ตามที่บริษัทเห็นสมควร
4.4.3 กรณีที่สมาชิกประสงค์ที่จะยกเลิกการเป็นสมาชิก สมาชิกต้องแจ้งให้บริษัททราบล่วงหน้าเป็นหนังสือไม่น้อยกว่า 30 (สามสิบ) วัน ก่อนระยะเวลาการเป็นสมาชิกในปัจจุบันจะสิ้นสุดลง โดยการยกเลิกจะมีผลหลังจากวันสุดท้ายของระยะเวลาการเป็นสมาชิกในปัจจุบัน และสมาชิกจะถูกลดระดับเป็นผู้ใช้บริการแบบทั่วไปทันที
4.4.4 หากสมาชิก เลิกบริษัท หรือการทำการชำระบัญชี หรือถูกควบรวมกิจการ หรือถูกฟ้องคดีเพื่อให้ฟื้นฟูกิจการ หรือตกเป็นบุคคลหนี้สินล้นพ้นตัว หรือถูกพิพากษาให้ล้มละลาย หรือถูกพิทักษ์ทรัพย์เด็ดขาด ให้สัญญาฉบับนี้สิ้นสุดลงทันที
4.5 กรณีการเป็นสมาชิกสิ้นสุดลงไม่ว่าจะโดยบริษัทหรือสมาชิก รวมถึงกรณีบริษัทระงับการเข้าถึงบริการของบริษัท สมาชิกตกลงว่าบริษัทไม่มีหน้าที่ต้องชดใช้ค่าเสียหายหรือมีความรับผิดชอบใด ๆ ต่อสมาชิก และบริษัทสงวนสิทธิ์ในการไม่คืนค่าบริการไม่ว่าจำนวนใดก็ตามที่สมาชิกได้ชำระให้แก่บริษัทแล้ว

5. การระงับระบบ
โดยไม่เป็นการตัดสิทธิหรือสิทธิที่บริษัทจะได้รับการเยียวยาต่างๆ บริษัทมีสิทธิที่จะระงับการให้บริการระบบจัดการร้านค้าออนไลน์ และการเข้าถึงและใช้ระบบดังกล่าวของสมาชิก หากสมาชิกฝ่าฝืนหรือปฏิบัติผิดเงื่อนไขข้อใดข้อหนึ่งของข้อกำหนดและเงื่อนไขของ FILLGOODS ข้อกำหนดและเงื่อนไข SUBSCRIPTION ฉบับนี้ ข้อเสนอ หรือข้อกำหนดและเงื่อนไขการขนส่ง รวมถึงข้อกำหนดและเงื่อนไขต่าง ๆ ที่สอดคล้องกับการเป็นสมาชิก รวมถึงแต่ไม่จำกัดเพียงการผิดนัดชำระค่าบริการสมาชิกเมื่อถึงกำหนดชำระ บริษัทไม่สามารถหักชำระเงินค่าบริการสมาชิกผ่านข้อมูลการชำระเงินที่สมาชิกให้ไว้แก่บริษัท หรือหากปล่อยให้สมาชิกเข้าถึง หรือใช้ระบบของบริษัทต่อไปจะทำให้เกิดความเสี่ยง หรือความเสียหายต่อระบบของบริษัท ทั้งนี้ ขึ้นอยู่กับดุลพินิจของบริษัทแต่เพียงผู้เดียว

6. การเปลี่ยนแปลง
6.1 บริษัทสงวนสิทธิ์ในการปรับ แก้ไข เปลี่ยนแปลง ข้อกำหนดและเงื่อนไข SUBSCRIPTION ฉบับนี้ หรือข้อเสนอ รวมถึงข้อกำหนดและเงื่อนไขต่าง ๆ ที่สอดคล้องกับการเป็นสมาชิก ได้เป็นครั้งคราวโดยบริษัทจะใช้ความพยายามในการแจ้งการเปลี่ยนแปลงให้สมาชิกทราบผ่านช่องทางที่บริษัทกำหนด
6.2 การใช้ระบบจัดการร้านค้าออนไลน์ของบริษัทหลังจากมีการเปลี่ยนแปลง จะถือว่าสมาชิกตกลงและยอมรับในการปฏิบัติตามการปรับ แก้ไข เปลี่ยนแปลงนั้น ทั้งนี้ เป็นหน้าที่ของสมาชิกที่ต้องตรวจสอบข้อกำหนดและเงื่อนไข SUBSCRIPTION ฉบับนี้ หรือข้อเสนอ รวมถึงข้อกำหนดและเงื่อนไขต่าง ๆ ที่สอดคล้องกับการเป็นสมาชิกอยู่เสมอ เพื่อที่จะทราบถึงการปรับ แก้ไข หรือเปลี่ยนแปลงต่างๆ

ข้อเสนอแพ็กเกจซิลเวอร์
การสมัครใช้บริการตามข้อเสนอแพ็กเกจซิลเวอร์เป็นไปตามข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจซิลเวอร์ (“ข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจซิลเวอร์”) นี้ซึ่งอยู่ภายใต้ข้อกำหนดและเงื่อนไข SUBSCRIPTION โดยหากข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจซิลเวอร์นี้ มิได้ระบุไว้เป็นอย่างอื่น ให้คำหรือข้อความๆ ตามข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจซิลเวอร์นี้มีความหมายเช่นเดียวกับที่ระบุไว้ในข้อกำหนดและเงื่อนไข SUBSCRIPTION

1. บทนำ
การสมัครใช้บริการแพ็กเกจซิลเวอร์ให้สิทธิ์เพิ่มเติมจากระดับผู้ใช้บริการฟรีแก่สมาชิกแบบชำระค่าบริการ (SUBSCRIPTION) แต่เพียงผู้เดียวนับตั้งแต่วันที่ได้รับการอนุมัติจากบริษัท โดยบริษัทขอสงวนสิทธิ์ในการยกเลิกหรือระงับการใช้บริการแพ็กเกจซิลเวอร์ทันทีหรือเมื่อใดก็ได้ หากสมาชิกไม่ปฏิบัติตามหลักเกณฑ์และขอบเขตการรับสิทธิ์เข้าใช้งานและตามที่ได้กำหนดไว้ในข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจซิลเวอร์นี้ รวมทั้งข้อกำหนดและเงื่อนไขของ FILLGOODS ข้อกำหนดและเงื่อนไข SUBSCRIPTION ข้อกำหนดและเงื่อนไขการขนส่ง หรือข้อกำหนดและเงื่อนไขต่าง ๆ ที่สอดคล้องกับการเป็นสมาชิก

2. หลักเกณฑ์และขอบเขตการใช้บริการแพ็กเกจซิลเวอร์
2.1 สมาชิกต้องปฏิบัติตามหลักเกณฑ์การสมัครใช้บริการแพ็กเกจซิลเวอร์ตามที่บริษัทกำหนด ไม่ว่าจะเป็นขั้นตอนการสมัคร การชำระค่าบริการ หรือการนำส่งเอกสารหลักฐานต่าง ๆ ให้แก่บริษัท
2.2 การชำระค่าสมาชิกแพ็กเกจซิลเวอร์ไม่สามารถใช้ส่วนลดอื่น ๆ ได้ และจะไม่มีการคืนเงินหรือเครดิตใด ๆ ให้แก่สมาชิก
2.3 บริษัทจำกัดการสร้างออเดอร์ของสมาชิก ไม่เกิน 1,500 (หนึ่งพันห้าร้อย) ออเดอร์ ต่อ 1 (หนึ่ง) เดือน
2.4 สมาชิกจะได้รับราคาค่าขนส่งพิเศษสำหรับแพ็กเกจซิลเวอร์ตามที่บริษัทกำหนดภายใต้ข้อกำหนดและเงื่อนไขการขนส่ง และสิทธิ์พิเศษเพิ่มเติมต่าง ๆ อันเป็นไปตามที่บริษัทประกาศไว้

ข้อเสนอแพ็กเกจโกลด์
การสมัครใช้บริการตามข้อเสนอแพ็กเกจโกลด์เป็นไปตามข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจโกลด์ (“ข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจโกลด์”) นี้ซึ่งอยู่ภายใต้ข้อกำหนดและเงื่อนไข SUBSCRIPTION โดยหากข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจโกลด์นี้ มิได้ระบุไว้เป็นอย่างอื่น ให้คำหรือข้อความๆ ตามข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจโกลด์นี้มีความหมายเช่นเดียวกับที่ระบุไว้ในข้อกำหนดและเงื่อนไข SUBSCRIPTION

1. บทนำ
การสมัครใช้บริการแพ็กเกจโกลด์ให้สิทธิ์เพิ่มเติมจากระดับผู้ใช้บริการฟรีแก่สมาชิกแบบชำระค่าบริการ (SUBSCRIPTION) แต่เพียงผู้เดียวนับตั้งแต่วันที่ได้รับการอนุมัติจากบริษัท โดยบริษัทขอสงวนสิทธิ์ในการยกเลิกหรือระงับการใช้บริการแพ็กเกจโกลด์ทันทีหรือเมื่อใดก็ได้ หากสมาชิกไม่ปฏิบัติตามหลักเกณฑ์และขอบเขตการรับสิทธิ์เข้าใช้งานและตามที่ได้กำหนดไว้ในข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจโกลด์นี้ รวมทั้งข้อกำหนดและเงื่อนไขของ FILLGOODS ข้อกำหนดและเงื่อนไข SUBSCRIPTION ข้อกำหนดและเงื่อนไขการขนส่ง หรือข้อกำหนดและเงื่อนไขต่าง ๆ ที่สอดคล้องกับการเป็นสมาชิก

2. หลักเกณฑ์และขอบเขตการใช้บริการแพ็กเกจโกลด์
2.1 สมาชิกต้องปฏิบัติตามหลักเกณฑ์การสมัครใช้บริการแพ็กเกจโกลด์ตามที่บริษัทกำหนด ไม่ว่าจะเป็นขั้นตอนการสมัคร การชำระค่าบริการ หรือการนำส่งเอกสารหลักฐานต่าง ๆ ให้แก่บริษัท
2.2 การชำระค่าสมาชิกแพ็กเกจโกลด์ไม่สามารถใช้ส่วนลดอื่น ๆ ได้ และจะไม่มีการคืนเงินหรือเครดิตใด ๆ ให้แก่สมาชิก
2.3 บริษัทจำกัดการสร้างออเดอร์ของสมาชิก ไม่เกิน 6,000 (หกพัน) ออเดอร์ ต่อ 1 (หนึ่ง) เดือน
2.4 สมาชิกจะได้รับราคาค่าขนส่งพิเศษสำหรับแพ็กเกจโกลด์ตามที่บริษัทกำหนดภายใต้ข้อกำหนดและเงื่อนไขการขนส่ง  และสิทธิ์พิเศษเพิ่มเติมต่าง ๆ อันเป็นไปตามที่บริษัทประกาศไว้

ข้อเสนอแพ็กเกจแพลทินัม
การสมัครใช้บริการตามข้อเสนอแพ็กเกจแพลทินัมเป็นไปตามข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจแพลทินัม (“ข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจแพลทินัม”) นี้ซึ่งอยู่ภายใต้ข้อกำหนดและเงื่อนไข SUBSCRIPTION โดยหากข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจแพลทินัมนี้ มิได้ระบุไว้เป็นอย่างอื่น ให้คำหรือข้อความๆ ตามข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจแพลทินัมนี้มีความหมายเช่นเดียวกับที่ระบุไว้ในข้อกำหนดและเงื่อนไข SUBSCRIPTION

1. บทนำ
การสมัครใช้บริการแพ็กเกจแพลทินัมให้สิทธิ์เพิ่มเติมจากระดับผู้ใช้บริการฟรีและแพ็กเกจโกลด์แก่สมาชิกแบบชำระค่าบริการ (SUBSCRIPTION) แต่เพียงผู้เดียวนับตั้งแต่วันที่ได้รับการอนุมัติจากบริษัท โดยบริษัทขอสงวนสิทธิ์ในการยกเลิกหรือระงับการการใช้บริการแพ็กเกจแพลทินัมทันทีหรือเมื่อใดก็ได้ หากสมาชิกไม่ปฏิบัติตามหลักเกณฑ์และขอบเขตการรับสิทธิ์เข้าใช้งานและตามที่ได้กำหนดไว้ในข้อกำหนดและเงื่อนไขการใช้บริการแพ็กเกจแพลทินัมนี้ รวมทั้งข้อกำหนดและเงื่อนไขของ FILLGOODS ข้อกำหนดและเงื่อนไข SUBSCRIPTION ข้อกำหนดและเงื่อนไขการขนส่ง หรือข้อกำหนดและเงื่อนไขต่าง ๆ ที่สอดคล้องกับการเป็นสมาชิก

2. หลักเกณฑ์และขอบเขตการใช้บริการแพ็กเกจแพลทินัม
2.1 สมาชิกต้องปฏิบัติตามหลักเกณฑ์การสมัครใช้บริการแพ็กเกจแพลทินัมตามที่บริษัทกำหนด ไม่ว่าจะเป็นขั้นตอนการสมัคร การชำระค่าบริการ หรือการนำส่งเอกสารหลักฐานต่าง ๆ ให้แก่บริษัท
2.2 การชำระค่าสมาชิกแพ็กเกจแพลทินัมไม่สามารถใช้ส่วนลดอื่น ๆ ได้ และจะไม่มีการคืนเงินหรือเครดิตใด ๆ ให้แก่สมาชิก
2.3 บริษัทจำกัดการสร้างออเดอร์ของสมาชิก ไม่เกิน 30,000 (สามหมื่น) ออเดอร์ ต่อ 1 (หนึ่ง) เดือน
2.4 สมาชิกจะได้รับราคาค่าขนส่งพิเศษสำหรับแพ็กเกจแพลทินัมตามที่บริษัทกำหนดภายใต้ข้อกำหนดและเงื่อนไขการขนส่ง และสิทธิ์พิเศษเพิ่มเติมต่าง ๆ อันเป็นไปตามที่บริษัทประกาศไว้
`;
