export const POLICY_HEADER = `
Privacy Policy
นโยบายความเป็นส่วนตัว
`;

export const POLICY_CONTENT = `บริษัท บีทีวาย มาร์เก็ตติ้ง จำกัด (“บริษัท” หรือ “ของบริษัท”) ถือว่าการคุ้มครองความเป็นส่วนตัวของผู้ขอใช้บริการเป็นสิ่งสำคัญยิ่ง บริษัทจึงแก้ไขเพิ่มเติมนโยบายคุ้มครองความเป็นส่วนตัวของบริษัท (“นโยบายคุ้มครองความเป็นส่วนตัว” ฉบับนี้) เพื่อเป็นการให้ความกระจ่างเรื่องการดำเนินการของบริษัทในการจัดการข้อมูลส่วนบุคคลโดยที่ยังคงให้บริการแก่ผู้ขอใช้บริการได้อย่างมีประสิทธิภาพเช่นเดิม ซึ่งมีดังต่อไปนี้
บริษัทจะเก็บข้อมูลส่วนบุคคลไว้ตลอดเวลาที่ผู้ขอใช้บริการยังใช้งานอยู่เป็นระยะเวลาเท่าที่จำเป็นเพื่อบรรลุตามวัตถุประสงค์การขอรับบริการตามรายละเอียดในนโยบายคุ้มครองส่วนตัวนี้หรือปฏิบัติตามกฎหมายและระเบียบที่ใช้บังคับ
บริษัทอาจเก็บข้อมูลส่วนบุคคลของท่านไว้แม้ภายหลังจากที่ผู้ขอใช้บริการยุติการใช้บริการแล้ว หากมีความจำเป็นตามสมควรที่จะต้องเก็บไว้ดังนี้
เพื่อปฏิบัติตามกฎหมายและระเบียบที่ใช้บังคับหรือหน้าที่ตามกฎหมาย
เพื่อให้บริการช่วยเหลือผู้ใช้บริการได้อย่างครบถ้วนสมบูรณ์
เพื่อระงับข้อพิพาทระหว่างหรือที่มีกับผู้ใช้บริการตลอดระยะเวลาที่ใช้บังคับได้ หรือ
เพื่อตรวจจับและป้องกันมิให้มีการใช้บริการโดยไม่ได้รับอนุญาตหรือใช้ในลักษณะฉ้อฉล หรือมิชอบ
ตั้งแต่วันที่19 กันยายน 2562 บริษัทจะเริ่มต้นในการใช้ข้อมูลส่วนบุคคลเฉพาะของผู้ขอใช้บริการที่ให้ความยินยอมในเรื่อง “เกี่ยวกับการใช้ข้อมูลของท่าน” เท่านั้น เค้าโครงรายละเอียดในเรื่องข้อมูลตามวัตถุประสงค์ดังกล่าวนั้นมีดังต่อไปนี้
ข้อความ รูปภาพ วิดีโอ
บริษัทจะจำกัดการใช้ข้อมูลตามที่กำหนดไว้ข้างต้นเฉพาะผู้ขอใช้บริการที่ได้ให้ความยินยอมต่อการใช้ข้อมูลดังกล่าวเท่านั้น
นอกจากนี้เพื่อเป็นการให้ความกระจ่างในเรื่องประเภทของข้อมูลซึ่งบริษัทได้รับและวิธีการที่บริษัทใช้ข้อมูลนั้น บริษัทได้จัดระเบียบในเรื่องข้อมูลที่บริษัทได้รับมารวมทั้งเรื่องวัตถุประสงค์ในการใช้ข้อมูลดังกล่าว
บริษัทอาจให้ข้อมูลส่วนบุคคลของผู้ขอใช้บริการบางส่วนแก่บุคคลภายนอก ข้อมูลที่จะจัดให้จะจํากัดเฉพาะข้อมูลที่น้อยที่สุดเท่าที่จําเป็นเท่านั้น การจัดให้ซึ่งข้อมูลนอกเหนือไปจากที่ระบุข้างต้นยังคงจะต้องเป็นไปตามคํายืนยันตามเจตนาของท่านซึ่งเหมือนเช่นการปฏิบัติก่อนหน้านี้
1. บทนำ
บริษัท ฟิลกู้ด เทคโนโลยี จํากัด (“บริษัท” หรือ “ของบริษัท”) เชื่อว่า ความเป็นส่วนตัวของบริษัท ฟิลกู้ด เทคโนโลยี จํากัด (“บริษัท” หรือ “ของบริษัท”) เป็นสิ่งสําคัญยิ่งในการบรรลุตามข้อผูกพันของบริษัทในการเคารพและคุ้มครองความเป็นส่วนตัวของบริษัท ฟิลกู้ด เทคโนโลยี จํากัด (“บริษัท” หรือ “ของบริษัท”) บริษัทจะปฏิบัติตามหลักการพื้นฐานเหล่านี้
1. บริษัทจะเรียนให้ผู้ขอใช้บริการทราบเกี่ยวกับข้อมูลส่วนบุคคลที่จะทำการเก็บรวบรวม และขอความยินยอมจากผู้ขอใช้บริการตามที่เห็นสมควรเพื่อเก็บรวบรวม ประมวลผลการใช้งาน หรือเปิดเผยข้อมูลส่วนบุคคลของผู้ขอใช้บริการ
2. บริษัทจะระบุวัตถุประสงค์ของการเก็บรวบรวมและประมวลผลข้อมูลส่วนบุคคลของผู้ขอใช้บริการ
3. บริษัทเก็บรวบรวมเฉพาะข้อมูลที่จำเป็นสำหรับการปฏิบัติตามวัตถุประสงค์การใช้งานที่ระบุเท่านั้น
4. บริษัทจะใช้หรือเปิดเผยข้อมูลส่วนบุคคลของผู้ขอใช้บริการตามวัตถุประสงค์ในการเก็บรวบรวมเท่านั้น ยกเว้นได้รับความยินยอมจากผู้ขอใช้บริการหรือตามที่กฎหมายใช้บังคับกำหนดหรืออนุญาต และบริษัท จะเก็บรักษาข้อมูลของผู้ขอใช้บริการไว้เท่าที่จำเป็นสำหรับวัตถุประสงค์เหล่านั้นเท่านั้น
5. บริษัทจะพยายามดำเนินการให้แน่ใจว่า ข้อมูลส่วนบุคคลของผู้ขอใช้บริการ ถูกต้อง ครบถ้วน และเป็นปัจจุบัน
6. บริษัทจะจัดให้มีเทคนิคและมาตรฐานองค์กรที่เหมาะสมเพื่อคุ้มครองข้อมูลส่วนบุคคลของผู้ขอใช้บริการอย่างเหมาะสม
7. บริษัทจะจัดทำนโยบายและแนวปฏิบัติต่างๆ ของบริษัท เพื่อให้การจัดการข้อมูลส่วนบุคคล ของผู้ขอใช้บริการมีความโปร่งใสตามสมควรเท่าที่จะเป็นไปได้
8. ผู้ขอใช้บริการจะมีสิทธิเข้าถึงข้อมูลส่วนบุคคลของผู้ขอใช้บริการและสามารถแก้ไขข้อมูลส่วนบุคคลของผู้ขอใช้บริการให้ถูกต้องตามความเหมาะสมและสิทธิของผู้ขอใช้บริการที่ได้รับตามกฎหมายที่ใช้บังคับ
9. บริษัทจะรับผิดชอบต่อผู้ขอใช้บริการโดยบริษัทยินดีรับฟังความคิดเห็นของผู้ขอใช้บริการเกี่ยวกับการปฏิบัติ ตามหลักการเหล่านี้ นโยบายคุ้มครองความเป็นส่วนตัวนี้ และกฎหมายที่ใช้บังคับ
2. ขอบเขตนโยบายคุ้มครองความเป็นส่วนตัว
ก. เป้าหมายของนโยบายคุ้มครองความเป็นส่วนตัว
นโยบายคุ้มครองความเป็นส่วนตัวนี้อธิบายวิธีการที่บริษัทใช้ในการจัดการและปกป้องข้อมูลส่วนบุคคลของผู้ขอใช้บริการ และสิทธิและทางเลือกต่างๆ ที่เกี่ยวกับข้อมูลส่วนบุคคลของผู้ขอใช้บริการ นโยบายคุ้มครองความเป็นส่วนตัวนี้ใช้บังคับกับข้อมูลส่วนบุคคลที่บริษัทเก็บรวบรวมรับจากผู้ขอใช้บริการเมื่อผู้ขอใช้บริการใช้บริการระบบการจัดการร้านค้าที่เชื่อมต่อการขนส่ง
3. ประเภทข้อมูลส่วนบุคคลที่บริษัทเก็บรวบรวม
ก. ข้อมูลส่วนบุคคลใดที่บริษัทเก็บรวบรวม
ก-1.ข้อมูลส่วนบุคคลที่บริษัทอาจเก็บรวบรวมนั้นจะรวมถึงแต่ไม่จำกัดเพียง:
ชื่อ
ที่อยู่อีเมล
วันเกิด
ที่อยู่ตามบัตรประชาชนหรือพาสปอร์ต
ที่อยู่สำหรับเรียกเก็บเงิน
ที่อยู่สำหรับการจัดส่ง
รายละเอียดบัญชีธนาคารและข้อมูลการชำระเงิน
หมายเลขติดต่อ
หมายเลขบัตรประชาชนหรือหมายเลขพาสปอร์ต
เพศ
ที่อยู่อินเทอร์เน็ตโปรโตคอล (IP)
ข้อมูลอื่นใดเกี่ยวกับผู้ขอใช้บริการเมื่อผู้ขอใช้บริการลงทะเบียนเข้าใช้บริการหรือไซต์ของเรา และเมื่อผู้ขอใช้บริการหรือไซต์ รวมถึงข้อมูลที่เกี่ยวกับวิธีการใช้บริการหรือไซต์ของผู้ใช้บริการ
ประชาชนทั่วไปและกลุ่มที่คุณเชื่อมต่อหรืออาจเชื่อมต่อกันบนแพลตฟอร์มของบริษัท และลักษณะที่ผู้ขอใช้บริการติดต่อสื่อสารกับบุคคลเหล่านั้น
ข้อมูลจากหรือเกี่ยวกับอุปกรณ์ที่คุณติดตั้งแอปพลิเคชั่นของบริษัท และ/หรือใช้อุปกรณ์เพื่อเข้าถึงบริการของผู้ขอใช้บริการและ/หรือไซต์
รายละเอียดบัญชีของผู้ขอใช้บริการกับเว็บไซต์หรือแอปพลิเคชั่นของบุคคลภายนอกที่ผู้ขอใช้บริการได้เชื่อมต่อบัญชีผู้ใช้ของผู้ขอใช้บริการกับบริษัทผ่านทางไซต์
ข้อมูลส่วนบุคคลอื่นใดที่ผู้ขอใช้บริการอาจให้แก่บริษัทผ่านทางไซต์เกี่ยวกับบัญชีผู้ใช้ของผู้ขอใช้บริการ เมื่อผู้ขอใช้บริการสร้างบัญชี (“บัญชีผู้ใช้”) บริษัทจะขอให้ผู้ขอใช้บริการระบุชื่อ หมายเลขโทรศัพท์และอีเมล์แอดเดรสของผู้ขอใช้บริการ ข้อมูลนี้เป็นข้อมูลที่จำเป็นเนื่องจากบริษัทอาจติดต่อมิให้มีการใช้บริการโดยไม่ได้รับอนุญาต หรือใช้ในลักษณะฉ้อฉลหรือในทางมิชอบ นอกจากนี้บริษัทอาจใช้หมายเลขโทรศัพท์และอีเมล์แอดเดรสที่ผู้ขอใช้บริการลงทะเบียนนี้เพื่อส่งข้อมูลสำคัญเกี่ยวกับบริการให้แก่ผู้ขอใช้บริการอีกด้วย
ทั้งนี้ ผู้ขอใช้บริการอาจเลือกสร้างบัญชีโดยใช้บัญชี Facebook ของผู้ขอใช้บริการก็ได้ ขอเรียนให้ทราบว่า บริษัทมิได้เก็บรหัส Facebook ของผู้ขอใช้บริการ ผู้ขอใช้บริการจำเป็นต้องให้ข้อมูลข้างต้นเพื่อสร้างบัญชีและใช้บริการ
ก-2.ข้อมูลอุปกรณ์และบันทึกการเข้าถึงเมื่อผู้ขอใช้บริการใช้บริการของบริษัท
เมื่อผู้ขอใช้บริการใช้บริการของบริษัท บริษัทอาจขอรับและเก็บรักษาข้อมูลแสดงตัวตนทางอิเล็กทรอนิกส์หรือบันทึกข้อมูลที่ได้มาโดยอัตโนมัติจากอุปกรณ์ของผู้ขอใช้บริการบางรายการ เช่น ประเภทอุปกรณ์ ระบบปฏิบัติการ เลขที่อยู่ไอพี ข้อมูลเบราว์เซอร์ รวมถึงประเภทและการตั้งค่าภาษา ตัวระบุเครื่อง ข้อมูลคุ๊กกี้ ตัวระบุโฆษณา
ในบางกรณีท่านอาจประสงค์ที่จะติดต่อกับบริษัทเพื่อขอรับบริการช่วยเหลือลูกค้าจากบริษัท หากท่านติดต่อบริษัทผ่านแบบฟอร์มติดต่อของบริษัท หรือโดยวิธีการอื่น บริษัทอาจขอรับและเก็บรักษาข้อมูลใดๆ ที่ท่านเลือกระบุไว้ ซึ่งรวมถึงชื่อของผู้ขอใช้บริการ และข้อมูลการติดต่อต่างๆ เช่น ที่อยู่อีเมล หมายเลขโทรศัพท์ ตลอดจนข้อมูลเกี่ยวกับอุปกรณ์เคลื่อนที่ของท่านหรือคอมพิวเตอร์ส่วนบุคคล เช่น ประเภทอุปกรณ์ และระบบปฏิบัติการของอุปกรณ์ดังกล่าว บริษัทจะใช้ข้อมูลนี้ในการแก้ไขและตรวจสอบปัญหาที่ท่านส่งมายังบริษัท เพื่อให้การช่วยเหลือแก่ผู้ขอใช้บริการและปรับปรุงบริการช่วยเหลือลูกค้าของบริษัทต่อไป บริษัทอาจประมวลผลข้อมูลนี้ที่เกี่ยวกับความช่วยเหลือที่ผู้ขอใช้บริการร้องขอมาจัดการกับบัญชีผู้ใช้ของผู้ขอใช้บริการ และเก็บข้อมูลนี้ไว้ตามบทบัญญัตินโยบายคุ้มครองความเป็นส่วนตัวนี้
ก-3.ข้อมูลการชำระเงิน
หากผู้ขอใช้บริการเลือกซื้อหรือใช้บริการเพิ่มเติมที่คิดค่าบริการ และชำระค่าบริการเพิ่มเติมดังกล่าวโดยวิธีการอื่น บริษัทอาจให้ผู้ให้บริการซึ่งเป็นบุคคลภายนอกเก็บและประมวลผลข้อมูลบัตรเครดิตของผู้ขอใช้บริการ โดยบริษัทจะใช้ข้อมูลบัตรเครดิตของผู้ขอใช้บริการเพื่อประมวลผลการซื้อหรือใช้บริการที่มีค่าบริการเท่านั้น โปรดทราบว่า บริษัทจะไม่เก็บข้อมูลบัตรเครดิตของผู้ขอใช้บริการไว้เกินจากระยะเวลาที่จำเป็นเพื่อการอำนวยความสะดวกในการชำระเงินที่เกี่ยวข้อง โดยการชำระเงินผ่านบัตรเครดิตของผู้ขอใช้บริการท่านจะได้รับการดำเนินการโดยหน่วยงานชำระเงินภายนอกที่เหมาะสม
จากข้อมูลประเภทต่างๆ ดังกล่าวข้างต้น บริษัทจะไม่ดู ใช้รายละเอียด หรือดำเนินการอื่นใดกับเนื้อหาส่วนตัวที่ท่านแลกเปลี่ยนกับผู้ใช้รายอื่นๆ โดยไม่ได้รับความยินยอมจากผู้ขอใช้บริการ
ข. เก็บข้อมูลส่วนบุคคลจากบุคคลภายนอกหรือไม่
ข-1.ข้อมูลเกี่ยวกับการใช้บริการที่จัดการดำเนินการโดยบุคคลภายนอก
เพื่อเป็นการจัดการบริการที่ให้ประโยชน์สูงสุดแก่ผู้ขอใช้บริการ บริษัทอาจได้รับข้อมูลส่วนบุคคลจากบุคคลภายนอกจากการที่ได้รับข้อมูลดังกล่าว อาจมีกรณีที่ได้รับข้อมูลส่วนบุคคลมาจากคู่ค้าที่ให้บริการเฉพาะบางประการ รวมถึงกรณีที่ได้รับข้อมูลส่วนบุคคลมาจากคู่ค้าที่ให้บริการต่างๆ ที่เชื่อมโยงกับบัญชีทางการ จากบริการอื่นๆ หากผู้ขอใช้บริการใช้บริการใดๆ ที่เชื่อมโยงกับบุคคลภายนอก บริษัทอาจออกรหัสภายในโดยอัตโนมัติเพื่อใช้เชื่อมต่อข้อมูลส่วนบุคคลของท่านกับบริการดังกล่าวและแชร์สิ่งเดียวกันนี้กับบุคคลภายนอกนั้น
ค. บริษัทใช้และจัดการข้อมูลของผู้ขอใช้บริการอย่างไร
ค-1.บริษัทนำข้อมูลของผู้ขอใช้บริการไปใช้อย่างไร
ในการให้บริการและบริการเพิ่มเติมอื่นใดๆ นั้นบริษัทซึ่งเป็นผู้ควบคุมข้อมูลหรือผู้ร่วมควบคุมข้อมูลจะใช้ข้อมูลส่วนบุคคลของผู้ขอใช้บริการเพื่อวัตถุประสงค์ตามนโยบายคุ้มครองความเป็นส่วนตัว ดังนี้
(ก)  เพื่อพิจารณาและ/หรือดำเนินการการยื่นเรื่อง/ธุรกรรมของผู้ขอใช้บริการกับบริษัท หรือธุรกรรมหรือการติดต่อสื่อสารของผู้ขอใช้บริการกับบุคคลภายนอกผ่านบริการ
(ข)  เพื่อจัดการ ดำเนินการ ให้ และ/หรือบริหารการใช้งานของผู้ขอใช้บริการและ/หรือเพื่อเข้าถึงบริการและเว็บไซต์ของบริษัท รวมถึงความสัมพันธ์และบัญชีผู้ใช้ของผู้ขอใช้บริการกับบริษัท
(ค)  เพื่อจัดการ ดำเนินการ บริหาร และจัดหาบริการแก่ผู้ขอใช้บริการ รวมถึงช่วยอำนวยความสะดวกในการจัดเตรียมบริการของบริษัท รวมถึงแต่ไม่จำกัดเพียง การจดจำความต้องการของผู้ขอใช้บริการ
(ง)  ปรับแต่งประสบการณ์ของผู้ขอใช้บริการผ่านบริการโดยแสดงเนื้อหาตามความสนใจและความต้องการของผู้ขอใช้บริการ พร้อมให้วิธีที่รวดเร็วในการเข้าถึงบัญชีของผู้ขอใช้บริการและส่งข้อมูลมายังบริษัท ซึ่งช่วยให้บริษัทสามารถติดต่อกับผู้ขอใช้บริการได้หากจำเป็น
(จ)  เมื่อผู้ขอใช้บริการใช้แอปพลิเคชั่น เว็บไซต์หรือบริการอื่นของบุคคลภายนอกที่ใช้หรือรวมกับบริการของบริษัท บุคคลภายนอกนั้นอาจรับข้อมูลเกี่ยวกับสิ่งที่ผู้ขอใช้บริการโพสต์หรือแบ่งปัน
(ฉ)  เพื่อตอบรับ ดำเนินการ จัดการ หรือทำธุรกรรมให้เสร็จสมบูรณ์ และ/หรือทำตามการร้องขอเกี่ยวกับผลิตภัณฑ์และบริการของผู้ขอใช้บริการ และแจ้งให้ผู้ขอใช้บริการทราบเกี่ยวกับปัญหาด้านการบริการและการดำเนินการเกี่ยวกับบัญชีที่มีความผิดปกติ
(ช)  เพื่อบังคับใช้เงื่อนไขการให้บริการหรือข้อตกลงสิทธิ์การใช้งานสำหรับผู้ใช้ที่เกี่ยวข้อง
(ซ)  เพื่อป้องกันความปลอดภัยและสิทธิ์ ทรัพย์สินส่วนบุคคล หรือความปลอดภัยของบุคคลอื่น
(ฌ)  เพื่อระบุตัวตนและ/หรือการตรวจสอบความถูกต้อง
(ญ)  เพื่อรักษาและควบคุมการอัปเดตซอฟต์แวร์และ/หรือการอัปเดตอื่นๆ และให้การสนับสนุนที่จำเป็นในบางคราวเพื่อให้แน่ใจว่าบริการของเราจะเป็นไปอย่างราบรื่น
(ฎ)  เพื่อจัดการหรืออำนวยความสะดวกในการให้บริการลูกค้า ปฏิบัติตามคำสั่งของผู้ขอใช้บริการ จัดการหรือตอบข้อซักถามที่ได้รับ (หรืออ้างว่าได้รับ) จากผู้ขอใช้บริการหรือในนามของผู้ขอใช้บริการ
(ฏ)  เพื่อติดต่อหรือสื่อสารกับผู้ขอใช้บริการผ่านการโทรด้วยเสียง ข้อความ และ/หรือข้อความแฟกซ์ อีเมล และ/หรือการส่งไปรษณีย์ หรือในรูปแบบอื่นใด เพื่อวัตถุประสงค์ในการบริหารและ/หรือจัดการความสัมพันธ์ระหว่างผู้ขอใช้บริการกับบริษัทหรือการใช้บริการของบริษัท เช่นว่าแต่ไม่จำกัดเพียง การสื่อสารข้อมูลด้านการจัดการที่เกี่ยวเนื่องกับบริการของบริษัทกับผู้ขอใช้บริการ ผู้ขอใช้บริการรับทราบและยอมรับว่าการสื่อสารดังกล่าวของบริษัทนั้นอาจเป็นด้วยวิธีการส่งจดหมายโต้ตอบ เอกสารหรือการแจ้งประกาศแก่ผู้ขอใช้บริการ ซึ่งอาจเกี่ยวข้องกับการเปิดเผยข้อมูลส่วนบุคคลของผู้ขอใช้บริการบางประการบนหน้าซอง/หีบห่อจดหมายด้านนอก เพื่อการจัดส่งสิ่งดังกล่าว
(ฐ)  เพื่อแจ้งให้ผู้ขอใช้บริการทราบเมื่อผู้ใช้คนอื่นส่งข้อความส่วนตัวหรือโพสต์ความคิดเห็นให้ผู้ขอใช้บริการบนไซต์
(ฑ)  เพื่อดำเนินการศึกษาวิจัย วิเคราะห์ และพัฒนากิจกรรมต่างๆ (รวมถึงแต่ไม่จำกัดเพียง การวิเคราะห์ข้อมูล การสำรวจ การพัฒนาผลิตภัณฑ์และบริการ และ/หรือ การทำแฟ้มประวัติ) เพื่อ วิเคราะห์การใช้บริการเพื่อนำไปปรับปรุงบริการหรือผลิตภัณฑ์ของบริษัท และ/หรือช่วยเสริมประสบการณ์ของลูกค้า
(ฒ)  เพื่อให้สามารถตรวจสอบและทำการสำรวจและอื่นๆ เพื่อตรวจสอบขนาดและองค์ประกอบของกลุ่มเป้าหมายของบริษัท และทำความเข้าใจเกี่ยวกับประสบการณ์ที่ผู้ขอใช้บริการได้รับจากบริการของ Fillgoods
(ณ)  ในกรณีที่ผู้ขอใช้บริการให้ความยินยอมให้บริษัทส่งข้อมูลการตลาดและการส่งเสริมการขาย และเอกสารที่เกี่ยวข้องกับผลิตภัณฑ์และ/หรือบริการ (รวมถึงแต่ไม่จำกัดเพียง ผลิตภัณฑ์และ/หรือบริการของบุคคลที่สามซึ่ง Fillgoods อาจทำงานร่วมกันหรือมีข้อผูกพันต่อกัน) เพื่อการตลาดและในเรื่องดังกล่าวนี้ โดยผ่านรูปแบบการติดต่อสื่อสารต่างๆ ได้แก่ การส่งไปรษณีย์ การบริการตามตำแหน่งที่ตั้งหรือรูปแบบอื่นใด ซึ่ง Fillgoods (และ/หรือบริษัทในเครือหรือบริษัทที่เกี่ยวข้อง) อาจจำหน่าย ทำการตลาด หรือส่งเสริมการขาย ไม่ว่าผลิตภัณฑ์หรือบริการดังกล่าวจะมีอยู่ในขณะนี้หรือจะเกิดขึ้นในอนาคตหรือไม่ก็ตาม
(ด)  เพื่อตอบสนองต่อกระบวนการทางกฎหมาย หรือปฏิบัติตามหรือเป็นไปตามกฎหมายที่บังคับใช้ ข้อกำหนดของภาครัฐหรือตามกฎข้อบังคับภายใต้อำนาจการพิจารณาที่เกี่ยวข้อง รวมถึงแต่ไม่จำกัดเพียง การดูแลให้เป็นไปตามข้อกำหนดเพื่อทำให้การเปิดเผยข้อมูลนั้นเป็นไปตามข้อกำหนดของกฎหมายที่ Fillgoods ต้องปฏิบัติตาม
(ต)  เพื่อจัดทำข้อมูลสถิติและงานวิจัยเพื่อการรายงานภายในองค์กรและตามกฎหมาย และ/หรือตามข้อกำหนดเกี่ยวกับการจัดเก็บบันทึก
(ถ)  เพื่อปฏิบัติตามขั้นตอนการตรวจสอบประวัติความเป็นมาทางธุรกิจหรือกิจกรรมการคัดกรองอื่นใด (รวมถึงแต่ไม่จำกัดเพียง การตรวจสอบประวัติความเป็นมา) ซึ่งเป็นไปตามข้อผูกพันทางกฎหมายหรือตามกฎข้อบังคับ หรือกระบวนการจัดการความเสี่ยงของเราซึ่งกฎหมายได้กำหนดไว้หรือที่บริษัทได้เป็นผู้นำมาใช้
(ท)  เพื่อตรวจสอบบริการของบริษัทหรือธุรกิจของ Fillgoods
(ธ)  เพื่อป้องกันและตรวจสอบการฉ้อโกง กิจกรรมที่ผิดกฎหมาย การละเว้นหรือการประพฤติผิด ไม่ว่าจะเกี่ยวข้องกับการใช้บริการของบริษัทหรือกิจกรรมอื่นใดอันเกิดจากความสัมพันธ์ของผู้ขอใช้บริการกับบริษัท และไม่ว่าจะมีความสงสัยในสิ่งที่ได้กล่าวถึงข้างต้นหรือไม่ก็ตาม
(น)  เพื่อจัดเก็บ โฮสต์ สำรองข้อมูล (ไม่ว่าจะเพื่อการกู้คืนจากความเสียหายหรือเหตุอื่นใด) ข้อมูลส่วนบุคคลของผู้ขอใช้บริการ ไม่ว่าจะอยู่ในหรือนอกอำนาจการพิจารณา
(บ)  เพื่อจัดการและ/หรือช่วยอำนวยความสะดวกให้แก่ธุรกรรมเกี่ยวกับทรัพย์สินของธุรกิจหรือธุรกรรมเกี่ยวกับทรัพย์สินของธุรกิจที่มีศักยภาพ ซึ่งธุรกรรมดังกล่าวเกี่ยวข้องกับ Fillgoods ในฐานะผู้มีส่วนร่วมหรือเกี่ยวข้องกับบริษัทที่เกี่ยวข้องหรือบริษัทในเครือของ Fillgoods ในฐานะผู้มีส่วนร่วมเท่านั้น หรือเกี่ยวข้องกับ Fillgoods และ/หรือบริษัทหรือบริษัทในเครือที่เกี่ยวข้องของ Fillgoods อย่างน้อยหนึ่งแห่งในฐานะผู้มีส่วนร่วม และอาจมีองค์กรภายนอกที่เป็นผู้มีส่วนร่วมในธุรกรรมดังกล่าว “ธุรกรรมเกี่ยวกับทรัพย์สินของธุรกิจ” หมายถึง การซื้อ ขาย ให้เช่า ควบรวม การควบ หรือการซื้อกิจการอื่นใด การจำหน่ายจ่ายโอนหรือการให้เงินทุนแก่องค์กรหรือส่วนหนึ่งส่วนใดขององค์กรหรือธุรกิจหรือทรัพย์สินอื่นใดขององค์กร และ/หรือ
(ป)  วัตถุประสงค์อื่นใดที่เราได้แจ้งแก่ผู้ขอใช้บริการ ณ เวลาที่ได้รับความยินยอมจากผู้ขอใช้บริการ (รวมเรียกว่า “วัตถุประสงค์”)
ค-2.บริษัทจะปกป้องข้อมูลส่วนบุคคลของผู้ขอใช้บริการอย่างไร
ในการดำเนินการตามพันธะหน้าที่ที่จะเคารพและคุ้มครองความเป็นส่วนตัวของผู้ขอใช้บริการ และการเก็บรักษาข้อมูลส่วนบุคคลของผู้ขอใช้บริการเป็นความลับ ผู้ขอใช้บริการได้ใช้มาตรฐานความปลอดภัยทางเทคนิคและทางองค์กรที่เหมาะสม รวมถึงมาตรการป้องกันตามมาตรฐานของอุตสาหกรรมด้านนี้เพื่อป้องกันการเข้าถึงหรือเปิดเผยโดยมิได้รับอนุญาต การใช้งานในทางมิชอบ การเปลี่ยนแปลงแก้ไข หรือการทำลายข้อมูลของผู้ขอใช้บริการ เนื่องจากไม่มีวิธีการส่งข้อมูลทางอิเล็กทรอนิกส์ใดหรือวิธีการจัดเก็บข้อมูลใดที่สมบูรณ์แบบหรือไม่สามารถเจาะผ่านได้ บริษัทจึงไม่อาจรับประกันได้ว่า ข้อมูลส่วนบุคคลของผู้ขอใช้บริการจะปลอดภัยแบบเบ็ดเสร็จจากการบุกรุกในระหว่างการส่งข้อมูลหรือจัดเก็บเข้าระบบของบริษัทเพื่อช่วยคุ้มครองสิทธิความเป็นส่วนตัวของผู้ขอใช้บริการและเก็บรักษาข้อมูลส่วนบุคคลของผู้ขอใช้บริการ
ค-3.บริษัทจะเก็บข้อมูลของผู้ขอใช้บริการไว้นานเท่าใด
บริษัทจะเก็บข้อมูลส่วนบุคคลไว้ตลอดเวลาที่ผู้ขอใช้บริการยังใช้งานอยู่เป็นระยะเวลาเท่าที่จำเป็นเพื่อบรรลุตามวัตถุประสงค์การใช้งานตามรายละเอียดในนโยบายคุ้มครองส่วนตัวนี้ หรือปฏิบัติตามกฎหมายและระเบียบที่ใช้บังคับ
บริษัทอาจเก็บข้อมูลส่วนบุคคลของผู้ขอใช้บริการไว้แม้ภายหลังจากที่ยุติแล้ว หากมีความจำเป็นตามสมควรที่จะต้องเก็บไว้ดังนี้
เพื่อปฏิบัติตามกฎหมายและระเบียบที่ใช้บังคับหรือหน้าที่ตามกฎหมาย
เพื่อให้บริการช่วยเหลือผู้ขอใช้บริการได้อย่างครบถ้วนสมบูรณ์
เพื่อระงับข้อพิพาทระหว่างหรือที่มีกับผู้ขอใช้บริการตลอดระยะเวลาที่ใช้บังคับได้ หรือ
เพื่อตรวจจับและป้องกันมิให้มีการใช้บริการโดยไม่ได้รับอนุญาตหรือใช้ในลักษณะฉ้อฉล หรือมิชอบ
ง. บริษัทใช้ผู้ให้บริการหรือตัวแทนให้บริการภายนอกหรือไม่
เพื่อให้บริการ ในบางครั้งบริษัทจำเป็นต้องให้ผู้ให้บริการซึ่งเป็นบุคคลภายนอกประมวลผลข้อมูลของผู้ใช้ที่อาจรวมถึงข้อมูลส่วนบุคคลของผู้ขอใช้บริการ บริษัทคัดเลือกผู้ให้บริการซึ่งเป็นบุคคลภายนอกดังกล่าวอย่างเคร่งครัด และบริษัทดำเนินการตามสมควรเพื่อให้มั่นใจว่าผู้ให้บริการซึ่งเป็นบุคคลภายนอกได้วางระบบการจัดการข้อมูลและการควบคุมภายในองค์กรที่เหมาะสมและปลอดภัย และบริษัทได้กำหนดหน้าที่ตามสัญญาแก่ผู้ให้บริการดังกล่าวเพื่อให้ผู้ให้บริการดังกล่าวต้องปฏิบัติตามกฎหมายและระเบียบที่ใช้บังคับเกี่ยวกับการประมวลผลข้อมูลส่วนบุคคลด้วย นอกจากนี้บริษัทยังกำหนดให้ผู้ให้บริการซึ่งเป็นบุคคลภายนอกดังกล่าวเข้าถึงข้อมูลส่วนบุคคลของท่านเฉพาะเพียงภายในขอบเขตที่จำเป็นตามคำสั่งและวัตถุประสงค์ของบริษัทเท่านั้น
จ. บริษัทให้ข้อมูลของผู้ขอใช้บริการแก่บุคคลภายนอกหรือไม่
นอกเหนือจากรายละเอียดข้างต้นในนโยบายคุ้มครองความเป็นส่วนตัวนี้ และนโยบายคุ้มครองความเป็นส่วนตัวหรือบันทึกต่อท้ายอื่นๆ ที่เกี่ยวข้องบริษัทจะไม่ให้ข้อมูลของผู้ขอใช้บริการแก่บุคคลอื่นโดยไม่ได้รับความยินยอมจากผู้ขอใช้บริการ เว้นแต่ว่าเป็นกรณีที่บริษัทเชื่อโดยสุจริตว่าบริษัทจำเป็นหรือได้รับอนุญาตให้ดำเนินการดังกล่าวตามกฎหมายที่ใช้บังคับ ยกเว้นกรณีต่อไปนี้
กรณีที่ผู้ขอใช้บริการใช้บริการที่เชื่อมโยงกับบุคคลภายนอก หรือกรณีอื่นๆ ที่มีการให้ข้อมูลซึ่งน้อยที่สุดเท่าที่จำเป็นแก่คู่ค้าเพื่อระบุตัวตนผู้ใช้ ในกรณีดังกล่าวนั้น บริษัทจะให้เฉพาะข้อมูลน้อยที่สุดเท่าที่จำเป็นเท่านั้นแก่บุคคลภายนอก (รหัสภายใน ข้อมูลบางส่วนเกี่ยวกับอุปกรณ์ (เช่น เลขรหัสประจำตัวของโฆษณา การตั้งค่าภาษา ข้อมูลเกี่ยวกับที่มา เป็นต้น) และในการให้ข้อมูลชื่อ ที่อยู่ หมายเลขโทรศัพท์ ฯลฯ เหล่านี้ บริษัทจะดำเนินการให้มั่นใจว่าได้ยืนยันเจตนาของผู้ขอใช้บริการอีกครั้งหนึ่งแล้ว
ฉ. บริษัทใช้คุ๊กกี้ (Cookies) หรือเทคโนโลยีอื่นที่คล้ายคลึงกันหรือไม่
บริษัทใช้คุกกี้หรือเทคโนโลยีการจัดเก็บเฉพาะอื่นที่มีลักษณะคล้ายคลึงกัน
คุ๊กกี้ คือ แฟ้มข้อมูลย่อยที่ถูกเก็บรักษาไว้อยู่บนคอมพิวเตอร์ของผู้ขอใช้บริการเมื่อผู้ขอใช้บริการเข้าเยี่ยมชมเว็บไซต์ แฟ้มข้อมูลนี้จะเก็บข้อมูลที่เว็บไซต์สามารถใช้อ่านได้อีกเมื่อผู้ขอใช้บริการเข้าเยี่ยมชมเว็บไซต์นั้น ในครั้งหน้า ข้อมูลคุ๊กกี้บางข้อมูลมีความจำเป็นเพราะมิเช่นนั้นแล้วเว็บไซต์จะไม่สามารถทำงานได้อย่างเหมาะสม ส่วนข้อมูลคุ๊กกี้อื่นๆ นั้นช่วยอำนวยความสะดวกให้แก่ผู้เยี่ยมชมโดยการจดจำชื่อผู้ใช้ (username) ในทางที่ปลอดภัยและตามภาษาที่ผู้ขอใช้บริการเลือก คุ๊กกี้มีไว้เพื่อให้ผู้ขอใช้บริการมิต้องเติมข้อมูลเดิมๆ ในแต่ละครั้งที่ผู้ขอใช้บริการเยี่ยมชมเว็บไซต์บริษัทใช้คุกกี้เพื่อ:
ช่วยบริษัทในการรักษาข้อมูลเซสชัน (Session) ของผู้ขอใช้บริการเมื่อผู้ขอใช้บริการใช้บริการและ/หรือบริการเพิ่มเติมใดๆ
เพิ่มประสิทธิภาพการรักษาความปลอดภัยของระบบของบริษัท
เก็บค่าพึงใจ (Preference) และให้บริการที่กำหนดค่าตามความต้องการของผู้ขอใช้บริการ และ
ช่วยบริษัทในการทำความเข้าใจว่า ประชาชนใช้บริการอย่างไรและเพื่อการปรับปรุงบริการบริษัทใช้คุ๊กกี้ของบุคคลภายนอกดังต่อไปนี้ด้วยบนเว็บไซต์
ตัวเก็บข้อมูลกูเกิ้ล (Google Analytics)
การที่ผู้ขอใช้บริการใช้บริการต่อไปเป็นการบ่งชี้ว่า ผู้ขอใช้บริการยอมรับให้บริษัทใช้คุ๊กกี้และเทคโนโลยีที่คล้ายคลึงกันตามนโยบายคุ้มครองความเป็นส่วนตัว
บราวเซอร์ของอินเตอร์เน็ตส่วนใหญ่อนุญาตให้ผู้ขอใช้บริการควบคุมได้ว่าจะยอมรับการใช้คุ๊กกี้หรือไม่ หากผู้ขอใช้บริการปิดการใช้คุ๊กกี้หรือจำกัดความสามารถในการตั้งค่าคุ๊กกี้ ผู้ขอใช้บริการอาจไม่สามารถรับสิทธิประโยชน์จากเว็บไซต์หรือเข้าถึงทุกฟังก์ชันได้ซึ่งอาจจำกัดการใช้งานโดยรวมของผู้ขอใช้บริการ
4. ทางเลือกของผู้ขอใช้บริการ
สิทธิของผู้ขอใช้บริการมีความเป็นไปได้ที่บริษัทอาจได้รับข้อมูลส่วนบุคคลที่เกี่ยวกับบุคคลที่ไม่ใช่ผู้ใช้บริการในปัจจุบัน โปรดทราบว่า ไม่ว่าจะเป็นผู้ใช้บริการหรือไม่ ผู้ขอใช้บริการสามารถเลือกและมีสิทธิต่างๆ ตามหัวข้อนี้หากบริษัทเก็บข้อมูลส่วนบุคคลของผู้ขอใช้บริการ
ก. ผู้ขอใช้บริการจะควบคุมข้อมูลของผู้ขอใช้บริการได้อย่างไร
ภายใต้บังคับแห่งกฎหมายที่ใช้บังคับ (รวมถึงข้อยกเว้นหรือบทยกเว้นภายใต้กฎหมายดังกล่าว) ผู้ขอใช้บริการอาจมีสิทธิเข้าถึงข้อมูลส่วนบุคคลของผู้ขอใช้บริการ สิทธิในการแก้ไขข้อผิดพลาดในข้อมูลส่วนบุคคลให้ถูกต้อง สิทธิคัดค้านการประมวลผลข้อมูลส่วนบุคคลของผู้ขอใช้บริการโดยอาศัยเหตุที่ถูกต้องตามกฎหมาย เพื่อใช้สิทธิใดๆ ของผู้ขอใช้บริการภายใต้กฎหมายที่ใช้บังคับ ผู้ขอใช้บริการอาจติดต่อบริษัทผ่านทางแบบฟอร์มติดต่อ เมื่อตรวจสอบตัวตนของผู้ขอใช้บริการแล้ว บริษัทจะตอบกลับคำขอของผู้ขอใช้บริการภายในระยะเวลาตามสมควรและตามกฎหมายที่เกี่ยวข้อง หากผู้ขอใช้บริการต้องการส่งคำขอที่เป็นลายลักษณ์อักษรมายังบริษัท กรุณาติดต่อและส่งมาทางที่อยู่ของบริษัท
อย่างไรก็ตาม หากกฎหมายที่ใช้บังคับอนุญาตให้กระทำได้ บริษัทอาจไม่สามารถตอบสนองตามข้อร้องขอของผู้ขอใช้บริการได้ หากมีเงื่อนไขดังต่อไปนี้
การเปิดเผยมีความเป็นไปได้ว่า จะเป็นอันตรายต่อชีวิต ร่างกาย ทรัพย์สิน หรือสิทธิหรือประโยชน์อื่นใดของผู้ขอใช้บริการหรือของบุคคลอื่น
การเปิดเผยมีความเป็นไปได้ว่าจะขัดขวางการดำเนินธุรกิจอย่างถูกต้องเหมาะสมของบริษัทอย่างร้ายแรง
การเปิดเผยขัดต่อกฎหมายอื่นๆ หรือ
หากผู้ขอใช้บริการไม่ยืนยันตัวตนของท่านเมื่อร้องขอให้มีการเปิดเผย
ข. หากผู้ขอใช้บริการเปลี่ยนใจจะทำอย่างไร
หากผู้ขอใช้บริการเปลี่ยนใจในเรื่องเกี่ยวกับขอบเขตของข้อมูลที่ผู้ขอใช้บริการประสงค์เปิดเผยต่อไป ผู้ขอใช้บริการสามารถเปลี่ยนแปลงโดยวิธีการส่งคำขอที่เป็นลายลักษณ์อักษรมายังบริษัท
ค. ข้อซักถาม/ข้อเสนอแนะ/ข้อกังวล
หากผู้ขอใช้บริการมีข้อซักถาม ข้อเสนอแนะ หรือข้อกังวลใดๆ เกี่ยวกับนโยบายคุ้มครองความเป็นส่วนตัวนี้หรือนโยบายหรือแนวทางปฏิบัติการคุ้มครองความเป็นส่วนตัวอื่นๆ ของบริษัท โปรดติดต่อบริษัทผ่านแบบฟอร์มติดต่อของบริษัทหรือทำหนังสือมาถึงบริษัทที่
บริษัท ฟิลกู้ด เทคโนโลยี จำกัด
อาคาร Asia Centre ชั้น 15, 16 แขวงทุ่งมหาเมฆ
เขตสาทร กรุงเทพมหานคร 10120
ง. การเปลี่ยนแปลงแก้ไขนโยบายคุ้มครองความเป็นส่วนตัวนี้
บริษัทอาจแก้ไขนโยบายคุ้มครองความเป็นส่วนตัวของบริษัทเป็นครั้งคราวด้วยเหตุผลหลากหลายประการซึ่งรวมถึงเพื่อปรับปรุงแนวทางปฏิบัติการคุ้มครองความเป็นส่วนตัวของบริษัทเพื่อให้สอดคล้องกับการเปลี่ยนแปลงบริการของบริษัทและปฏิบัติตามกฎหมายที่เกี่ยวข้อง บริษัทได้ทำการปรับปรุงนโยบายคุ้มครองความเป็นส่วนตัวนี้เมื่อวันที่ 19 กันยายน 2562 และจัดทำขึ้นครั้งแรกเมื่อวันที่ 1 กันยายน 2562
เมื่อบริษัททำการแก้ไขเปลี่ยนแปลงนโยบายคุ้มครองความเป็นส่วนตัวของบริษัทในสาระสำคัญ บริษัทจะแจ้งให้ผู้ขอใช้บริการทราบในบริการของบริษัทหรือโดยวิธีการอื่นตามสมควร บริษัทขอแนะนำให้ผู้ขอใช้บริการตรวจสอบการแก้ไขเปลี่ยนแปลงดังกล่าวด้วยความรอบคอบ หากผู้ขอใช้บริการตกลงตามการแก้ไข เปลี่ยนแปลงดังกล่าว โปรดใช้บริการของบริษัทต่อไป แต่หากผู้ขอใช้บริการไม่ตกลงตามการแก้ไขเปลี่ยนแปลงดังกล่าว และไม่ประสงค์จะใช้บริการของบริษัทอีกต่อไปแล้ว ผู้ขอใช้บริการอาจเลือกยุติการใช้บริการของผู้ขอใช้บริการได้ ซึ่งการที่ผู้ขอใช้บริการใช้บริการของบริษัทต่อไปหลังจากที่ได้มีการแจ้งให้ผู้ขอใช้บริการทราบเรื่องการแก้ไขเปลี่ยนแปลงแล้วหรือได้มีการประกาศในบริการของบริษัทแล้ว ถือว่าผู้ขอใช้บริการยอมรับการแก้ไขเปลี่ยนแปลงและยินยอมตามนโยบายคุ้มครองความเป็นส่วนตัวที่แก้ไขเปลี่ยนแปลงนี้แล้ว บริษัทจะขอความยินยอมจากผู้ขอใช้บริการ หากกฎหมายที่ใช้บังคับกำหนดไว้
`;
