export const POLICY_HEADER = `
Privacy Policy
นโยบายความเป็นส่วนตัว
`;

export const POLICY_CONTENT = `นโยบายความเป็นส่วนตัวนี้ระบุวิธีปฏิบัติเกี่ยวกับข้อมูลส่วนบุคคลที่เก็บรวบรวมผ่าน chatpang.com, Chatpang แอพพลิเคชั่น, บริการและเครื่องมือต่างๆ ซึ่งผู้ใช้งานเข้าใช้งาน เช่น การสมัครสมาชิก การสร้างข้อมูลสมาชิก และการจัดการฟังก์ชั่นต่างๆ 
ในการใช้งาน โดย Chatpang จะปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลของทุกเขตอำนาจรัฐที่ chatpang ประกอบการอยู่ โดยนโยบายความเป็นส่วนตัวนี้อยู่ภายใต้บังคับกฎหมายไทย\n
การใช้ chatpang.com, การดาวน์โหลด chatpang แอพพลิเคชั่น, บริการและเครื่องมือใด
ที่มีนโยบายความเป็นส่วนตัวปรากฏอยู่ ถือว่าผู้ใช้งานได้อ่าน เข้าใจ และให้ความยินยอมต่อการที่ Chatpang
จะใช้ข้อมูลส่วนบุคคลของผู้ใช้งานโดยสอดคล้องกับนโยบายความเป็นส่วนตัวนี้และนโยบายการใช้งานของ chatpang.com\n
โปรดทราบว่า เมื่อผู้ใช้งานเข้าลิงค์บางลิงค์ที่ chatpang.com หรือใน Chatpang แอพพลิเคชั่น
อาจมีการนำผู้ใช้งานไปยังแพลตฟอร์มของบุคคลอื่นนอกขอบเขตที่ Chatpang เป็นผู้ควบคุมอยู่ ในกรณีดังกล่าว
ข้อมูลที่มีการเก็บรวบรวมในแพลตฟอร์มอื่นนั้น จะอยู่นอกเหนืออำนาจควบคุมโดยตรงของ Chatpang
โดยจะมีการใช้บังคับนโยบายความเป็นส่วนตัวของบุคคลภายนอกดังกล่าวกับข้อมูลที่บุคคลภายนอกได้รับจากผู้ใช้งาน\n
ข้อมูลที่เก็บรวบรวม ได้รับ และควบคุม
เมื่อท่านสร้างบัญชี Chat pang ข้อมูลที่เราจัดเก็บอาจรวมถึงข้อมูลต่างๆ เหล่านี้
`;
