export const QUESTION_LISTS = [
  {
    key: 'key_01',
    title: 'Q :  ไม่เก่งคอมพิวเตอร์ สามารถใช้งานได้มั๊ย ?',
    answer: 'ทางบรอดปังมีคลิปวีดิโอสอนทุกขั้นตอนอย่างละเอียดและเรายังมีแอดมินซัพพอร์ตดูแลลูกค้าหลังการขายติดปัญหาตรงไหนแจ้งแอดมินในไลน์ซัพพอร์ตให้ดูแลได้เลย',
  },

  {
    key: 'key_02',
    title: 'Q : ซื้อแล้วจะได้อะไรบ้าง ?',
    answer: 'ทางบรอดปังมีคลิปวีดิโอสอนทุกขั้นตอนอย่างละเอียดและเรายังมีแอดมินซัพพอร์ตดูแลลูกค้าหลังการขายติดปัญหาตรงไหนแจ้งแอดมินในไลน์ซัพพอร์ตให้ดูแลได้เลย',
  },

  {
    key: 'key_03',
    title: 'Q : ราคาแพงมั๊ย ตอนนี้มีแพ๊คเกจอะไรบ้าง ?',
    answer: 'ทางบรอดปังมีคลิปวีดิโอสอนทุกขั้นตอนอย่างละเอียดและเรายังมีแอดมินซัพพอร์ตดูแลลูกค้าหลังการขายติดปัญหาตรงไหนแจ้งแอดมินในไลน์ซัพพอร์ตให้ดูแลได้เลย',
  },
];

export const HEADER_PAGE_TEXT = 'คำถามที่พบบ่อย';
