import React from 'react'

const index = () => {
  return (
    <div className="nosidebar-wrapper text-center">
      <div>
        <h1>นโยบายความเป็นส่วนตัว</h1>
      </div>
      <div className="text-start p-2 p-md-4">
        <div className="text-bold my-3 my-md-5">ขอบเขตนโยบายและความยินยอม</div>
        <p>
          นโยบายความเป็นส่วนตัวนี้ระบุวิธีปฏิบัติเกี่ยวกับข้อมูลส่วนบุคคลที่เก็บรวบรวมผ่าน chatpang.com, Chatpang
          แอพพลิเคชั่น, บริการและเครื่องมือต่างๆ ซึ่งผู้ใช้งานเข้าใช้งาน เช่น การสมัครสมาชิก การสร้างข้อมูลสมาชิก
          และการจัดการฟังก์ชั่นต่างๆ ในการใช้งาน โดย Chatpang
          จะปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลของทุกเขตอำนาจรัฐที่ chatpang ประกอบการอยู่
          โดยนโยบายความเป็นส่วนตัวนี้อยู่ภายใต้บังคับกฎหมายไทย
        </p>
        <p>
          การใช้ chatpang.com, การดาวน์โหลด chatpang แอพพลิเคชั่น, บริการและเครื่องมือใด
          ที่มีนโยบายความเป็นส่วนตัวปรากฏอยู่ ถือว่าผู้ใช้งานได้อ่าน เข้าใจ และให้ความยินยอมต่อการที่ Chatpang
          จะใช้ข้อมูลส่วนบุคคลของผู้ใช้งานโดยสอดคล้องกับนโยบายความเป็นส่วนตัวนี้และนโยบายการใช้งานของ chatpang.com
        </p>
        <p>
          โปรดทราบว่า เมื่อผู้ใช้งานเข้าลิงค์บางลิงค์ที่ chatpang.com หรือใน Chatpang แอพพลิเคชั่น
          อาจมีการนำผู้ใช้งานไปยังแพลตฟอร์มของบุคคลอื่นนอกขอบเขตที่ Chatpang เป็นผู้ควบคุมอยู่ ในกรณีดังกล่าว
          ข้อมูลที่มีการเก็บรวบรวมในแพลตฟอร์มอื่นนั้น จะอยู่นอกเหนืออำนาจควบคุมโดยตรงของ Chatpang
          โดยจะมีการใช้บังคับนโยบายความเป็นส่วนตัวของบุคคลภายนอกดังกล่าวกับข้อมูลที่บุคคลภายนอกได้รับจากผู้ใช้งาน
        </p>
        <div className="text-bold my-3 my-md-5">ข้อมูลที่เก็บรวบรวม ได้รับ และควบคุม</div>
        เมื่อท่านสร้างบัญชี Chat pang ข้อมูลที่เราจัดเก็บอาจรวมถึงข้อมูลต่างๆ เหล่านี้
        <ul>
          <li>ชื่อ</li>
          {/* <li>เพศ / อายุ</li> */}
          {/* <li>วันเดือนปีเกิด</li> */}
          <li>อีเมล</li>
          <li>หมายเลขติดต่อ / หมายเลขโทรศัพท์เคลื่อนที่</li>
        </ul>
        <br></br>
        <p>
          เราจะจัดเก็บข้อมูลข้อลูกค้าไว้ตลอดเวลา โดยลูกค้าสามารถเพิกถอนการจัดเก็บข้อมูลได้ตลอดเวลา ตามนโยบาย
          &quot;การเพิกถอนความยินยอม&quot;
        </p>
        <p>
          การบริการลูกค้า: เมื่อผู้ใช้งานติดต่อกับฝ่ายบริการลูกค้า Chatpang
          อาจเก็บรวบรวมข้อมูลส่วนบุคคลที่จำเป็นต้องใช้เพื่อปฏิบัติตามคำขอของผู้ใช้งาน
          และอาจติดต่อผู้ใช้งานเพื่อติดตามเรื่องตามที่จำเป็น ซึ่ง Chatpang
          อาจใช้ข้อมูลการติดต่อในข้อมูลสมาชิกที่ผู้ใช้งานได้ให้ Chatpang ไว้เพื่อวัตถุประสงค์ดังกล่าว และ Chatpang
          อาจเก็บรวบรวมข้อมูลอื่นเกี่ยวกับการติดต่อสื่อสารของ Chatpang กับผู้ใช้งาน เช่น คำขอรับบริการที่ผู้ใช้งานทำขึ้น
          หรือความเห็นที่ผู้ใช้งานได้ส่งมาให้ Chatpang
        </p>
        <p>
          ข้อมูลจากเว็บไซต์และอุปกรณ์เคลื่อนที่: Chatpang อาจได้รับข้อมูลจากบราวเซอร์หรืออุปกรณ์ของผู้ใช้งาน
          และบันทึกบนเซิร์ฟเวอร์ของ Chatpang โดยอัตโนมัติ ซึ่งรวมถึงไอพีแอดเดรส คุณสมบัติของซอฟต์แวร์และฮาร์ดแวร์
          เว็บเพจที่ผู้ใช้งานเรียก หมายเลขประจำเครื่อง ข้อมูลการใช้แอพพลิเคชั่นและอุปกรณ์อื่น หรือข้อมูลระบบ
          โดยการดำเนินการดังกล่าวอาจเกิดขึ้นที่ chatpang.com ใน Chatpang แอพพลิเคชั่น หรือบนแพลตฟอร์มบุคคลภายนอกด้วย
        </p>
        <p>
          ข้อมูลเพิ่มเติม: Chatpang อาจเพิ่มข้อมูลที่ Chatpang
          ได้รับจากพันธมิตรทางธุรกิจหรือบุคคลภายนอกมาโดยชอบด้วยกฎหมาย เข้าไปในข้อมูลผู้ใช้งานเดิมที่ Chatpang
          ถือครองอยู่
        </p>
        <div className="text-bold my-3 my-md-5">ไอพีแอดเดรส คุกกี้ และหมายเลขประจำเครื่อง</div>
        <p>
          Chatpang อาจเก็บรวบรวมข้อมูลบางอย่างผ่านเทคโนโลยี เช่น คุกกี้ พิกเซล
          และแหล่งเก็บข้อมูลบนบราวเซอร์หรืออุปกรณ์ของผู้ใช้งาน ทั้งนี้ คุกกี้
          เป็นไฟล์ข้อมูลตัวอักษรขนาดเล็กที่เก็บรวบรวมข้อมูลบนเครื่องคอมพิวเตอร์
          โทรศัพท์เคลื่อนที่หรืออุปกรณ์อื่นของผู้ใช้งาน ส่วนพิกเซล เป็นภาพขนาดเล็กอันเป็นส่วนหนึ่งของรหัสบนเว็บเพจ
          ซึ่งทำหน้าที่ต่างๆ เช่น ทำให้เซิร์ฟเวอร์อื่นสามารถวัดยอดการเข้าชมเว็บเพจ และมักจะใช้เชื่อมโยงกับคุกกี้
          โดยรหัสดังกล่าวจะทำการติดตามเมื่อมีการดาวน์โหลดพิกเซล
          เพื่อบ่งชี้ว่าผู้ใช้งานได้เข้าเชื่อมต่อกับจอภาพใดหรือบางส่วนของจอภาพใด
        </p>
        <p>
          ด้วยการทำงานของคุกกี้ เว็บเซิร์ฟเวอร์จะสามารถบันทึกสิ่งที่ผู้ใช้งานสนใจ และบันทึกการตั้งค่าบนคอมพิวเตอร์
          โทรศัพท์เคลื่อนที่ หรืออุปกรณ์อื่นของผู้ใช้งาน
          ซึ่งจะเรียกคืนค่าโดยอัตโนมัติในการเข้าเยี่ยมชมเว็บไซต์ครั้งถัดไป กล่าวอีกนัยหนึ่งคือ
          คุกกี้ถูกใช้เพื่อให้ผู้ใช้งานใช้เว็บไซต์ได้ง่ายยิ่งขึ้น
          เพื่อผู้ใช้งานจะไม่ต้องผ่านขั้นตอนการเข้าสู่ระบบซ้ำเมื่อผู้ใช้งานเข้าเยี่ยมชมเว็บไซต์อีกครั้ง ทั้งนี้ Chatpang
          ใช้คุกกี้ทั้งประเภทถาวรและประเภทชั่วคราว โดยคุกกี้ถาวรจะอยู่ในคอมพิวเตอร์ของผู้ใช้งานในระยะเวลาที่นานกว่า
          ในขณะที่คุกกี้ชั่วคราวจะถูกลบทิ้งโดยอัตโนมัติเมื่อปิดหน้าต่างบราวเซอร์
        </p>
        <p>
          Chatpang อาจอนุญาตให้บุคคลภายนอก เช่น ผู้ให้บริการด้านการตลาดหรือการวิเคราะห์
          ทำการเก็บรวบรวมข้อมูลโดยใช้เทคโนโลยีประเภทนี้โดยตรงบน Chatpang.com หรือใน Chatpang แอพพลิเคชั่น
          ซึ่งข้อมูลที่บุคคลดังกล่าวทำการเก็บรวบรวมจะอยู่ภายใต้บังคับนโยบายความเป็นส่วนตัวของบุคคลดังกล่าวด้วย
        </p>
        <div className="text-bold my-3 my-md-5">การใช้ข้อมูล</div>
        <p>Chatpang อาจใช้ข้อมูลที่ Chatpang เก็บรวบรวมและควบคุมไว้เพื่อวัตถุประสงค์ต่อไปนี้</p>
        <p>
          (1) เพื่อให้บริการแก่ผู้ใช้งาน รวมถึงการสร้างและบริหารจัดการบัญชีสมาชิก เพื่อแก้ไขปัญหาด้านเทคนิค
          และเพื่อเปิดใช้งานฟีเจอร์ต่างๆ
        </p>
        <p>(2) เพื่อปรับแต่งข้อเสนอและการใช้งาน รวมถึงการลงประกาศบน chatpang.com หรือบนแพลตฟอร์มของบุคคลภายนอก</p>
        <p>
          (3) เพื่อดูแลกิจกรรมการใช้งานโดยทั่วไปและกิจกรรมการใช้งานของผู้ใช้งานรายบุคคล เช่น การค้นหาคำสำคัญ
          การดำเนินธุรกรรม และเพื่อจัดการการสื่อสารบน Chatpang
        </p>
        <p>
          (4) เพื่อติดต่อผู้ใช้งาน สำหรับการบริการและการดูแลผู้ใช้งาน
          หรือสำหรับการสื่อสารด้านการตลาดที่ได้รับอนุญาตผ่านช่องทางติดต่อสื่อสารใดๆ ที่ใช้การได้
        </p>
        <p>(5) เพื่อวิจัยและวิเคราะห์ในการปรับปรุงบริการของ Chatpang</p>
        <p>
          (6) เพื่อบังคับใช้นโยบายการใช้งาน ข้อกำหนดและเงื่อนไขต่างๆ ของ Chatpang
          รวมทั้งเพื่อป้องกันมิจฉาชีพหรือการใช้งานในทางที่ผิด
        </p>
        <p>
          Chatpang อาจเก็บรักษาข้อมูลที่ Chatpang ได้จัดเก็บไว้ รวมถึงสังเกตการณ์บนเครือข่ายและในฐานข้อมูลของ Chatpang
          ได้นานเท่าที่จำเป็น เพื่อให้บรรลุวัตถุประสงค์ที่ระบุไว้ข้างต้น
        </p>
        <div className="text-bold my-3 my-md-5">การแบ่งปันข้อมูล</div>
        <p>
          Chatpang อาจแบ่งปันข้อมูลที่ Chatpang เก็บรวบรวมไว้ กับบริษัทในเครือ
          (บริษัทที่อยู่ภายใต้การครอบครองหรือความควบคุมเดียวกัน) หรือกลุ่มบริษัทซึ่งร่วมกันให้บริการ
          โดยบริษัทดังกล่าวจะประมวลผลและใช้ข้อมูลในการช่วยเหลือ Chatpang เพื่อวัตถุประสงค์ที่ระบุไว้ข้างต้น
          และจะปฏิบัติตามนโยบายความเป็นส่วนตัวนี้
        </p>
        <p>
          5.2 Chatpang จะไม่แบ่งปันข้อมูลส่วนบุคคลของผู้ใช้งาน Chatpang
          กับบุคคลภายนอกที่ไม่ใช่บริษัทในเครือหรือกลุ่มบริษัทร่วมให้บริการ
          เว้นแต่จะได้รับอนุญาตอย่างเฉพาะเจาะจงจากผู้ใช้งานให้กระทำได้ หรือเว้นแต่ในกรณีต่อไปนี้
        </p>
        <p>
          (1) Chatpang อาจใช้ผู้ให้บริการที่เป็นบุคคลภายนอกในการช่วยเสนอบริการด้านต่างๆ ของ Chatpang ซึ่งในกรณีนี้
          ผู้ให้บริการนั้นไม่มีอำนาจในการใช้ข้อมูลส่วนบุคคลในส่วนที่ดำเนินการแทน Chatpang โดยอิสระแต่อย่างใด
          และผู้ให้บริการดังกล่าวจะต้องอยู่ภายใต้บังคับนโยบายความเป็นส่วนตัวนี้
        </p>
        <p>
          (2) ผู้ใช้งานตกลงและยินยอมให้ Chatpang สามารถแบ่งปัน เปิดเผย ส่ง โอน หรือประมวลผลข้อมูลส่วนบุคคล
          ไม่ว่าส่วนหนึ่งส่วนใดหรือทั้งหมด ไปยังหรือให้แก่ผู้ให้บริการโครงข่ายโทรคมนาคมหรือโทรศัพท์เคลื่อนที่ได้ ทั้งนี้
          ข้อมูลส่วนบุคคลดังกล่าวรวมถึงแต่ไม่จำกัดเฉพาะ หมายเลขโทรศัพท์ของผู้ใช้งาน ทั้งนี้
          เพื่อให้ผู้ให้บริการโครงข่ายโทรคมนาคมและโทรศัพท์เคลื่อนที่สามารถยืนยันตัวตนของผู้ใช้งาน รวมถึงทำการประมวลผล
          วิเคราะห์ และดำเนินการอื่นที่เกี่ยวข้อง เพื่อการพัฒนาและเพิ่มประสิทธิภาพในการใช้งาน
        </p>
        <p>
          (3) Chatpang สงวนสิทธิในการแบ่งปันข้อมูลกับภาคเอกชนหรือหน่วยงานภาครัฐผู้มีอำนาจ ซึ่งจะทำให้ Chatpang
          สามารถต่อสู้กับมิจฉาชีพและการใช้งานในทางที่ผิดบนแพลตฟอร์มของ Chatpang
          เพื่อตรวจสอบการกระทำต้องสงสัยว่าละเมิดกฎหมาย
          เพื่อต่อสู้กับการกระทำต้องสงสัยว่าละเมิดนโยบายการใช้งานรวมถึงข้อกำหนดและเงื่อนไขต่างๆ ของ Chatpang
          เพื่อป้องกันสิทธิของ Chatpang หรือบุคคลภายนอกผู้สุจริต เพื่อเพิ่มความปลอดภัยและน่าเชื่อถือแก่ผู้ใช้งาน
          หรือเพื่อปกป้องคุ้มครองผู้ใช้งานอื่น
        </p>
        <p>(4) Chatpang อาจแบ่งปันข้อมูลส่วนบุคคลกับหน่วยงานภาครัฐผู้มีอำนาจตามที่กฎหมายที่เกี่ยวข้องกำหนด</p>
        <p>
          Chatpang มีนโยบายไม่จำหน่ายหรือให้เช่าข้อมูลส่วนบุคคลของผู้ใช้งาน Chatpang แก่บุคคลภายนอกที่ไม่เกี่ยวข้อง
          เว้นแต่ Chatpang จะได้รับอนุญาตเป็นการเฉพาะจากผู้ใช้งานให้สามารถกระทำได้ หรือ Chatpang
          ได้ระบุไว้อย่างชัดแจ้งด้วยความเชื่อโดยสุจริตว่าเป็นกรณีที่จำต้องกระทำเป็นการเฉพาะ อนึ่ง สำหรับกรณีที่ Chatpang
          มีการปรับโครงสร้างองค์กร หรือ Chatpang ได้โอนทรัพย์สินทั้งหมดหรือในส่วนที่เป็นสาระสำคัญให้เจ้าของรายใหม่
          อาจมีการโอนข้อมูลส่วนบุคคลของผู้ใช้งานให้แก่เจ้าของรายใหม่ เพื่อให้สามารถให้บริการได้อย่างต่อเนื่อง
        </p>
        <p>
          Chatpang อาจแบ่งปันข้อมูลที่ไม่ใช่ข้อมูลส่วนบุคคล (กล่าวคือ
          ข้อมูลที่ไม่สามารถระบุตัวตนของผู้ใช้งานเป็นแต่ละบุคคล) กับบุคคลภายนอกหรือพันธมิตรทางธุรกิจที่เชื่อถือได้
          หรือนักวิจัยที่ได้รับความเห็นชอบ เพื่อให้สามารถเข้าใจได้ดีขึ้นว่า ประกาศหรือบริการใดที่ผู้ใช้งานอาจสนใจ
          เพื่อปรับปรุงคุณภาพและประสิทธิภาพโดยรวมของ Chatpang หรือของผู้บุคคลภายนอกรายดังกล่าว
          หรือเพื่อสนับสนุนการวิจัยทางวิชาการที่ Chatpang เชื่อว่ามีประโยชน์ต่อสังคมในวงกว้าง
        </p>
        <div className="text-bold my-3 my-md-5">การเพิกถอนความยินยอม</div>
        <p>
          ท่านอาจส่งคำคัดค้านการใช้หรือการเปิดเผยข้อมูลส่วนตัวของท่านสำหรับกิจการต่างๆ
          หรือเพื่อวัตถุประสงค์ที่ระบุไว้ด้านบน แก่เราได้ตลอดเวลา โดยติดต่อเราผ่านทางอีเมลที่ระบุไว้ด้านล่างนี้
          โปรดทราบว่าหากท่านได้ส่งคำคัดค้านการใช้หรือการเปิดเผยข้อมูลส่วนตัวของท่านสำหรับกิจการต่างๆ
          หรือเพื่อวัตถุประสงค์ที่ระบุไว้ด้านบน ขึ้นอยู่กับพฤติการณ์ของคำคัดค้าน
          เราอาจไม่อยู่ในสถานะที่จะจัดส่งสินค้าหรือบริการให้แก่ท่านหรือปฏิบัติตามสัญญาต่อท่านได้
          เราขอสงวนสิทธิ์ทางกฎหมายและการเยียวยาไว้โดยชัดแจ้งในกรณีซึ่งเราไม่สามารถจัดส่งสินค้าหรือบริการให้แก่ท่านหรือตามปฏิบัติตามสัญญาต่อท่านได้อันเกิดจากคำคัดค้านดังกล่าว
        </p>
        <div className="text-bold my-3 my-md-5">การอัพเดทหรือปรับเปลี่ยนข้อมูลส่วนตัวของท่าน</div>
        <p>
          ท่านสามารถอัพเดทหรือปรับเปลี่ยนข้อมูลส่วนตัวของท่านได้ตลอดเวลาโดยการเข้าสู่บัญชีการใช้บริการของท่านบนแพลตฟอร์มของ
          Chatpang
          หากท่านไม่มีบัญชีการใช้บริการกับเราท่านอาจทำการอัพเดทหรือปรับเปลี่ยนข้อมูลส่วนตัวได้โดยการติดต่อเราผ่านทางอีเมลที่ระบุไว้ข้างใต้นี้
          เราจะดำเนินการส่งข้อมูลส่วนตัวที่เปลี่ยนแปลงแล้วแก่บุคคลภายนอกหรือบริษัทในเครือที่เราได้แบ่งปันข้อมูลส่วนตัวของท่าน
          หากข้อมูลส่วนตัวของท่านยังคงจำเป็นต่อกิจการที่กล่าวไว้ข้างบน
        </p>
        <div className="text-bold my-3 my-md-5">การเข้าถึงข้อมูลส่วนตัวของท่าน</div>
        <p>
          หากท่านต้องการที่จะเข้าดูข้อมูลส่วนตัวที่เรามีอยู่เกี่ยวกับท่าน
          หรือต้องการทราบเกี่ยวกับการใช้หรือเปิดเผยข้อมูลส่วนตัวของท่านโดย Chatpang ภายในปีที่ผ่านมา
          กรุณาติดต่อเราผ่านทางอีเมลด้านล่างนี้ เราขอสงวนสิทธิ์ในการคิดค่าธรรมเนียมการจัดการที่สมเหตุสมผล
          ในการเรียกดูบันทึกข้อมูลดังกล่าว หากท่านมีบัญชีการใช้บริการกับ Chatpang
          ท่านอาจเข้าดูรายละเอียดเกี่ยวกับการสั่งสินค้าของท่าน
          โดยการเข้าสู่ระบบบัญชีการใช้บริการของท่านบนแพลตฟอร์มอีคอมเมอร์ส
          ในนั้นท่านจะสามารถเรียกดูรายละเอียดเกี่ยวกับการสั่งสินค้าที่สมบูรณ์แล้วหรือที่ยังคงค้างอยู่
          หรือที่จะได้ส่งสินค้าให้ท่านในเวลาอันสั้น และสามารถจัดการข้อมูลที่อยู่การส่งสินค้า รายละเอียดเกี่ยวกับธนาคาร
          หรือการส่งข่าวสารที่ท่านได้สมัครไว้ได้ ท่านตกลงที่จะจัดการชื่อบัญชี รหัสผ่าน
          และรายละเอียดการสั่งสินค้าเป็นความลับ และจะไม่เปิดเผยต่อบุคคลภายนอกที่ไม่ได้รับอนุญาต
          เราไม่สามารถรับผิดชอบต่อความเสียหายที่เกิดจากการใช้ชื่อบัญชี รหัสผ่าน และรายละเอียดการสั่งสินค้าในทางที่ผิด
          เว้นแต่จะได้ระบุไว้ในข้อตกลงการใช้บริการ
        </p>
        <div className="text-bold my-3 my-md-5">ความมั่นคงปลอดภัย</div>
        <p>
          ข้อมูลที่ Chatpang
          เก็บรวบรวมจะได้รับการคุ้มครองโดยวิธีทางเทคนิคและขั้นตอนรักษาความมั่นคงปลอดภัยที่เหมาะสมตามควร
          เพื่อป้องกันการเข้าถึงหรือใช้ข้อมูลโดยไม่ได้รับอนุญาต ทั้งนี้ บริษัทในเครือของ Chatpang
          รวมถึงพันธมิตรทางธุรกิจที่เชื่อถือได้ และผู้ให้บริการที่เป็นบุคคลภายนอก
          จะได้รับมอบหมายให้จัดการข้อมูลส่วนบุคคล
          ตามข้อบังคับเกี่ยวกับการรักษาความมั่นคงปลอดภัยและการคุ้มครองข้อมูลส่วนบุคคลของ Chatpang
        </p>
        <p>
          เพื่อความปลอดภัยในข้อมูลส่วนบุคคลและความเป็นส่วนตัวในช่องทางติดต่อสื่อสารของผู้ใช้งาน
          ผู้ใช้งานตกลงปฏิบัติตามนโยบายความเป็นส่วนตัวนี้ รวมถึงนโยบายการใช้งาน และข้อกำหนดและเงื่อนไขการใช้บริการต่างๆ
          ของ Chatpang อย่างเคร่งครัด
          และผู้ใช้งานตกลงจะไม่กระทำการใดอันเป็นการล่วงละเมิดสิทธิส่วนบุคคลของผู้ใช้งานอื่นหรือบุคคลภายนอก ทั้งนี้ หาก
          Chatpang พบการล่วงละเมิดดังกล่าว Chatpang สงวนสิทธิในการยกเลิกและปิดกั้นการเข้าใช้ Chatpang
          ของผู้ใช้งานผู้กระทำการล่วงละเมิดนั้น
        </p>
        <p>
          กรณีที่ข้อมูลส่วนบุคคลและช่องทางติดต่อสื่อสารของผู้ใช้งานเสียหายหรือสูญหาย ไม่ว่าจะเกิดจากสาเหตุใด ซึ่งรวมถึง
          การจารกรรมด้วยวิธีการทางอิเล็กทรอนิกส์ (Hack) หรือวิธีการอื่น Chatpang
          ขอสงวนสิทธิโดยไม่ต้องรับผิดต่อความเสียหายหรือสูญหายดังกล่าว หรือต่อความเสียหายสืบเนื่องใดๆ ทั้งสิ้น
        </p>
        <div className="text-bold my-3 my-md-5">
          <b>การเปลี่ยนแปลงนโยบาย</b>
        </div>
        <p>
          นโยบายความเป็นส่วนตัวนี้ได้ทำการปรับปรุงล่าสุดเมื่อ 20 สิงหาคม 2565 โดย Chatpang
          อาจทำการปรับปรุงนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราว ซึ่ง Chatpang จะแจ้งไว้ให้เห็นอย่างชัดเจนใน chatpang.com
          และ Chatpang แอพพลิเคชั่น การใช้งาน Chatpang ต่อหลังจากการปรับปรุงนโยบายดังกล่าว
          ถือว่าผู้ใช้งานยืนยันยอมรับการแก้ไขปรับปรุงใดๆ ที่ทำขึ้นกับนโยบายความเป็นส่วนตัวนี้
        </p>
        <div className="text-bold my-3 my-md-5">
          <b>ข้อมูลสำหรับติดต่อ</b>
        </div>
        <p>
          หากมีข้อสงสัยใดเกี่ยวกับนโยบายความเป็นส่วนตัวนี้ ผู้ใช้งานสามารถสอบถามได้ที่{' '}
          <a href="mailto:chatpang@gmail.com">development.bty@gmail.com</a>
          {/* <span> 087-1352410</span> */}
        </p>
      </div>
    </div>
  )
}

export default index
