import { Container, Typography } from '@mui/material';
import React from 'react';
import AgreementStyle from './style';
import * as constants from '../../../constants/agreementConstants';
import { Image } from 'react-bootstrap';

const AgreementContainer = React.forwardRef((props, ref) => {
    return (
        <AgreementStyle ref={ref} navHeight={props.navHeight}>
            <Container maxWidth="xl">
                <div className="header">
                    <div className="text-center">
                        <Image src="/images/logo.png" className="image-cover-logo" />
                    </div>
                    <Typography variant="span">{constants.AGREEMENT_HEADER}</Typography>
                </div>
                {/* <div className="content">{constants.AGREEMENT_CONTENT}</div> */}
                <div className="content">
                    <div className="text-bold my-3 my-md-2">
                        <b>เงื่อนไขการใช้งานเว็บไซต์</b>
                    </div>
                    โดยการเข้าถึงเว็บไซต์นี้ ท่านยืนยันว่าเข้าใจ &qout;ข้อตกลงและเงื่อนไข&qout; ทั้งหมดแล้ว หากท่านไม่ยอมรับข้อตกลงและเงื่อนไขเหล่านี้ในการใช้งาน
                    ท่านจะไม่สามารถใช้เว็บไซต์นี้ได้ เว็บไซต์ขอสงวนสิทธิ์ในการเปลี่ยนแปลงแก้ไข ตลอดจนเพิ่มหรือลบบางส่วนของข้อตกลงและเงื่อนไขในการใช้งานนี้ได้ตลอดเวลา
                    การเปลี่ยนแปลงจะมีผลเมื่อทางเราได้เปลี่ยนแปลงข้อบังคับดังกล่าวบนเว็บไซต์โดยไม่จำเป็นจะต้องมีการแจ้งให้ทราบล่วงหน้า
                    กรุณาตรวจสอบข้อตกลงและเงื่อนไขในการใช้งานเป็นประจำสำหรับการปรับปรุงข้อมูลต่างๆ หากท่านใช้งานเว็บไซต์นี้หลังการการเปลี่ยนแปลงข้อตกลงและเงื่อนไขในการใช้งาน
                    ถือว่าท่านได้ยอมรับข้อเปลี่ยนแปลงนั้นโดยปริยาย หากท่านมีคำถามหรือความเห็น หรือหากมีข้อความใดที่ไม่เข้าใจ ท่านสามารถส่งอีเมล์ถึงเราได้ที่
                    <a href="mailto:sarunyhot@gmail.com">sarunyhot@gmail.com</a>
                    <div className="text-xl text-bold my-3 my-md-2">
                        <b>การใช้งานเว็บไซต์</b>
                    </div>
                    <p>
                        เราอนุญาตให้ท่านใช้งานเว็บไซต์นี้ได้ โดยที่ท่านต้องยอมรับ ข้อตกลงและเงื่อนไขในการใช้เว็บไซต์นี้
                        ซึ่งอยู่ภายใต้ข้อตกลงและเงื่อนไขที่อธิบายไว้ตามวัตถุประสงค์ของการช้อปปิ้ง สำหรับรายการสินค้าส่วนบุคคลที่ขายบนเว็บไซต์
                        ซึ่งใช้ในเชิงพาณิชย์หรือในนามของบุคคลที่สามใดๆ ก็ตาม ล้วนเป็นสิ่งต้องห้าม เว้นแต่ได้รับอนุญาตอย่างชัดเจนจากทางเราล่วงหน้า
                        การละเมิดข้อตกลงและเงื่อนไขเหล่านี้ส่งผลต่อไปในการเพิกถอนใบอนุญาตในวรรคนี้ได้ทันทีโดยไม่ต้องแจ้งให้ท่านทราบล่วงหน้า
                    </p>
                    <p>
                        ผู้ใช้เว็บไซต์ทุกคนเป็นผู้รับผิดชอบต่อการเก็บรหัสผ่านและระบุบัญชีอื่นที่ปลอดภัยและมีความปลอดภัย
                        เจ้าของบัญชีคือผู้ที่ต้องรับผิดชอบต่อการกระทำทั้งหมดที่เกิดขึ้นภายใต้รหัสผ่านหรือบัญชีดังกล่าว นอกจากนี้หากท่านไม่สามารถจำรหัสผ่านหรือบัญชีของท่านได้
                        ทางเว็บไซต์จะไม่รับผิดชอบทั้งโดยตรงหรือโดยอ้อม ในการสูญเสียหรือความเสียหายที่เกิดขึ้นชนิดที่เป็นผลจากพฤติกรรมใดๆ หรือความเกี่ยวข้องกับความล้มเหลวต่างๆ
                        ของท่านที่สอดคล้องกับในส่วนนี้ ในระหว่างขั้นตอนการลงทะเบียน ท่านยินยอมที่จะได้รับอีเมล์ส่งเสริมการขายจากเว็บไซต์
                        ซึ่งท่านก็สามารถเลือกที่จะไม่รับอีเมล์ส่งเสริมการขายได้ โดยการคลิกลิ้งค์ที่ด้านล่างของอีเมล์ส่งเสริมการขายนั้นๆ
                    </p>
                    <div className="text-xl text-bold my-3 my-md-2">
                        <b>การนำไปใช้ส่วนตัว</b>
                    </div>
                    การใช้ข้อมูลในไซต์นี้เป็นการใช้เพื่อเป็นข้อมูลเท่านั้น ท่านตกลงว่าจะไม่แจกจ่าย ตีพิมพ์ ส่งผ่าน เปลี่ยนแปลง แสดง
                    หรือสร้างเนื้องานเพิ่มเติมหรือใช้เนื้อหาที่ปรากฏอยู่ในเว็บไซต์นี้ไม่ว่าจะในลักษณะใดๆ ก็ตาม ท่านจะต้องไม่ทำสำเนา แจกจ่าย
                    หรือจัดแสดงข้อมูลที่ปรากฏอยู่ในเว็บไซต์นี้ไม่ว่าทั้งหมดหรือบางส่วนให้แก่บุคคลภายนอก ท่านจะต้องไม่เชื่อมต่อหรือลิ้งค์ (Link) หรือทำซ้ำ/เลียน (Mirror)
                    ส่วนใดของไซต์ โปรดทราบว่าเราไม่อนุญาตให้ท่านใช้ ทำซ้ำ หรือแจกข้อมูลใดก็ตามโดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรจากเรา
                    การละเมิดสิทธิ์เหล่านี้จะนำไปสู่การดำเนินคดีตามความเหมาะสม ท่านตกลงจะชดใช้ ต่อสู้คดี และไม่ทำให้ Chatpang ต้องได้รับความเสียหายจากการใช้ข้อมูลใดๆ
                    จากเว็บไซต์โดยที่ไม่ได้รับอนุญาต ท่านยอมรับว่าการใช้เนื้อหาสาระและข้อความต่างๆ
                    ที่ปรากฏในเว็บไซต์นี้โดยไม่ได้รับอนุญาตอาจทำให้เกิดความเสียหายที่ถึงขั้นแก้ไขไม่ได้ต่อ Chatpang และในกรณีที่เป็นการใช้โดยไม่ได้รับอนุญาต
                    เรามีสิทธิ์ที่จะได้รับการคุ้มครองจากศาล นอกเหนือไปจากการเยียวยาชดใช้ตามกฎหมายหรือด้วยความเป็นธรรมในฐานะเจ้าของ
                    <div className="text-xl text-bold my-3 my-md-2">
                        <b>การกรอกข้อมูลเข้าสู่ระบบ</b>
                    </div>
                    ข้อมูลทั้งหมดที่ท่านส่งไปยังเว็บไซต์ และ/หรือ ให้ไว้กับเราซึ่งรวมถึงแต่ไม่จำกัดเฉพาะ คำถามรีวิวความคิดเห็นและข้อเสนอแนะ (รวมเรียกว่า &qout;การส่งข้อมูล&qout;)
                    จะกลายเป็นข้อมูลของทางบริษัทฯ แต่เพียงผู้เดียว และข้อมูลดังกล่าวทั้งหมดจะต้องไม่ถูกส่งกลับไปยังท่าน และเมื่อท่านแสดงความคิดเห็นใดๆในเว็บไซต์ของเรา
                    ท่านยินยอมให้เราสามารถใช้ชื่อบัญชีที่ท่านส่งในการเชื่อมต่อกับความคิดเห็นดังกล่าวแสดงความคิดเห็นหรือเนื้อหาอื่นๆได้ทันที
                    และท่านจะต้องไม่ใช้อีเมล์เท็จหรือหลอกว่าเป็นคนอื่นที่ไม่ใช่ตนเองหรือทำให้เกิดความเข้าใจผิดต่อบริษัทฯ หรือบุคคลที่สามโดยเด็ดขาด
                    และทางเราจะไม่ลบหรือแก้ไขสิ่งส่งมอบโดยท่านทั้งนั้น
                    <div className="text-xl text-bold my-3 my-md-2">
                        <b>การชำระเงินและนโยบายการคืนเงิน</b>
                    </div>
                    <p>
                        หลังจากเลือกแพ็คเกจและชำระเงินเรียบร้อยแล้ว ระบบจะทำการตัดเงินตามรอบบิลที่แจ้งไว้ในแต่ละเดือนโดยอัตโนมัต โดยท่านสามารถกดยกเลิกได้ที่หน้าสมาชิก
                        หากไม่ต้องการใช้งานต่อ
                    </p>
                    <p>
                        ท่านจะต้องดำเนินเรื่องคืนเงินภายใน 14 วัน นับจากวันที่เริ่มชำระเงิน หากเกิน 14 วันไปแล้ว Chatpang ขอสงวนสิทธิในการคืนเงินทุกกรณี <br />
                        กรณีลูกค้าชำระเงินเต็มจำนวนผ่านบัตรเครดิตของธนาคารพาณิชย์ที่จดทะเบียนในประเทศไทย บริษัทจะส่งเรื่องขอคืนเงินไปยังธนาคาร
                        โดยการคืนเงินจะขึ้นอยู่กับนโยบายของแต่ละธนาคาร ตามปกติแล้วผู้ถือบัตรจะได้รับเงินคืนในรอบบิลถัดไป
                    </p>
                    <div className="text-xl text-bold my-3 my-md-2">
                        <b>เครื่องหมายการค้าและลิขสิทธิ์</b>
                    </div>
                    ข้อมูลบนเว็บไซต์ทั้งหมดเป็นทรัพย์สินทางปัญญาของทางบริษัทฯ ไม่ว่าจะจดทะเบียนหรือไม่จดทะเบียนทรัพย์สินทางปัญญา
                    เนื้อหาข้อมูลบนเว็บไซต์และการออกแบบเว็บไซต์ซึ่งรวมถึงข้อความกราฟฟิค, ซอฟต์แวร์, ภาพถ่าย, วิดีโอ, เพลง, เสียงและการคัดสรรและการจัดเรียง
                    รวมถึงซอฟแวร์ซอร์สโค้ดและซอฟต์แวร์ที่รองรับจะยังคงเป็นทรัพย์สินของเรา
                    เนื้อหาทั้งหมดของเว็บไซต์นี้ยังได้รับความคุ้มครองตามกฎหมายลิขสิทธิ์เป็นงานส่วนรวมภายใต้กฎหมายลิขสิทธิ์ของไทยและอนุสัญญาระหว่างประเทศ
                    ขอสงวนสิทธิ์ทั้งหมดโดยชอบธรรม
                    <div className="text-xl text-bold my-3 my-md-2">
                        <b>กฎหมายที่ใช้บังคับ</b>
                    </div>
                    ข้อตกลงและเงื่อนไขนี้จะต้องถูกตีความและควบคุมโดยกฎหมายที่ถูกบังคับใช้ในราชอาณาจักรไทย
                    <div className="text-xl text-bold my-3 my-md-2">
                        <b>การเลิกใช้</b>
                    </div>
                    เราขอสงวนสิทธิ์ในการยกเลิกข้อตกลงและเงื่อนไข หรือสั่งเพิกถอนการใดหรือทั้งหมดของสิทธิ์ซึ่งท่านได้รับภายใต้ข้อตกลงและเงื่อนไขดังกล่าวได้ตลอดเวลา
                    เมื่อสิ้้นสุดของข้อตกลงนี้ท่านยอมรับที่จะยกเลิกการเข้าถึงข้อมูลการใช้งานในเว็บไซต์เราทั้งหมด และการใช้เว็บไซต์ในทั้งหมดหรือบางส่วนนี้
                    การสิ้นสุดของข้อตกลงนี้จะไม่กระทบกระเทือนสิทธิ์ตามกฎหมายและข้อผูกพัน (รวมถึง แต่ไม่จำกัดเฉพาะ ข้อผูกพันการชำระเงิน) ของกิจการที่เกิดขึ้นก่อนวันที่ยกเลิก
                    ท่านยอมรับว่าเว็บไซต์จะไม่รับผิดชอบต่อท่านหรือต่อบุคคลอื่นใดที่เป็นผลมาจากการระงับดังกล่าวใดๆ หรือเลิกจ้าง หากท่านไม่พอใจกับเว็บไซต์หรือไม่พอใจกับเงื่อนไขใดๆ
                    ตามเงื่อนไข และกฎกติกา นโยบาย แนวทาง ท่านมีสิทธิ์ที่จะหยุดการใช้งานเว็บไซต์เราได้โดยทันที
                    <div className="text-xl text-bold my-3 my-md-2">
                        <b>ข้อมูลองค์กร</b>
                    </div>
                    <p>ที่อยู่จดทะเบียน : บริษัท บีทีวาย มาเก็ตติ้ง จำกัด</p>
                    <p>169/93 หมู่บ้านอรินสิริ@ข้าวหลาม ต.ห้วยกะปิ อ.เมือง จ.ชลบุรี 20000</p>
                    <p>
                        อีเมล <a href="mailto:chatpang@gmail.com">development.bty@gmail.com</a>
                    </p>
                    <p>ทะเบียนพาณิชย์เลขที่ 0205564034862</p>
                </div>
            </Container>
        </AgreementStyle>
    );
});

export default AgreementContainer;
